[
  {
    "date": "2026-02-13",
    "title": "Darryl & Roberto — Container Logistics Call",
    "filename": "2026-02-13-darryl-roberto-logistics.md",
    "content": "# Darryl & Roberto — Container Logistics Call\n## February 13, 2026 | 19 minutes\n\n**Source:** [Plaud Recording](https://web.plaud.ai/s/pub_f961931b-85a9-4762-b2da-964938d306a4::lWfYPURqeBbJDcFKdUasVKKVN76F5wQVy8SHbEborEvymKj9zgM9nV0CGP8pLIEQfAw8cyEIO6tEJvwC)\n\n---\n\n## Strategy for Filling Wine Containers\n\n- **Objective:** Darryl aims to pre-sell as much of each container as possible, targeting ~50% in the future. The Prosecco for Pepe Jello's is an example of a fully pre-sold order.\n- **Speculation Strategy:** Darryl introduced Mika's purchasing validation document — a process for making better-informed decisions when speculating on wines, using AI to research potential wines.\n  - The tool analyzes ratings and availability on major retail sites to provide data-driven insights.\n- **Roberto's View:** While this process is valuable for the future, the immediate priority is to fill the nearly empty warehouse to establish a product base for the market.\n\n## Market Opportunities and Competitive Analysis\n\n- **Current Demand:** Roberto reported that **Grand Hyatt and One GT (Josh Town)** requested a price list and a meeting. He plans to inform them products are currently en route.\n- **AI-Powered Analysis:** Darryl shared the competitive analysis performed by Mika.\n  - Scraped competitors' websites (Blackbeard's, Tortuga, Mario's, etc.) — found minimal product overlap, confirming importers typically have exclusive deals.\n  - Identified Mario as the premium provider, with exclusive high-end wines such as Sassicaia.\n- **Market Gaps Identified:**\n  - \"White space\" for globally popular wines (certain rosés, proseccos, white wines) not currently available on-island.\n  - Gap for Brunellos in the $100–$150 price range — aligns with Fattoria dei Barbi.\n- **Strategic Wins:** Roberto secured distribution for **Fattoria dei Barbi** and **Caparzo**, anticipating a competitor (Mario) who was also pursuing them.\n\n## Current Container & Inventory Status\n\n### Italian Wine Container (40-foot)\n- Final order list to be completed by **Tuesday/Wednesday next week**\n- Estimated departure from Italy: **February 26**\n- Roberto will send all final invoices to Tallyn once confirmed (avoid confusion from daily changes)\n- Container will likely be **more than half Prosecco** (private cuvée and regular)\n- Other wines: Sauvignon Blanc, Pinot Grigio, Amarone, Caparzo, Fattoria dei Barbi, mix from Fontini\n- Roberto may add **Barolo from Corsetti** — the Ritz has started ordering it\n\n### California & French Wine\n- A pallet of California wine just received — none pre-sold, intended for inventory targeting \"by the glass\" market at restaurants\n- A **20-foot container from France** is planned, work to begin after Italian container is finalized\n\n## Business Growth and Approach\n\n- **Roberto's Strategy:** Build a solid inventory base first. This enables approaching clients like hotels and restaurants with reliable supply — crucial for securing business.\n- **Order Frequency Disagreement:** Darryl would like to order a container every month. Roberto advised a slower start to establish market presence, projecting next order for **July/August**.\n\n## Next Steps\n\n1. **Roberto:** Finalize the 40-foot Italian container list by next Tuesday/Wednesday\n2. **Roberto:** Send all confirmed proforma invoices to Tallyn for Cin7 entry\n3. **Roberto:** Meet with Grand Hyatt and One GT next week, provide price list\n4. **Roberto:** Begin planning the 20-foot French container after Italian one is finalized\n5. **Darryl:** Requested Roberto review the two emailed documents (Speculation Strategy + Competitive Analysis) and provide feedback\n\n## Unresolved Issues (AI Flagged)\n\n1. **Order frequency misalignment** — Darryl wants monthly containers, Roberto says next order July/August. Need to align on growth and cash flow projection.\n2. **California wine sales plan** — Strategy is to target \"by the glass\" market, but no concrete sales/marketing plan defined.\n3. **White space opportunities** — Identified but no decision or action item assigned to validate and pursue them.\n"
  },
  {
    "date": "2026-02-13",
    "title": "7 Cellars Partner Call — February 13, 2026",
    "filename": "2026-02-13-partner-call.md",
    "content": "# 7 Cellars Partner Call — February 13, 2026\n\n**Duration:** 85 minutes\n**Attendees:** Darryl, Kyle, Dwayne\n**Source:** [Fathom Recording](https://fathom.video/share/hCigZc4uKnA5V8zJU6yj-PPZ5eH-Zguy)\n**Chair:** Darryl\n\n## Meeting Purpose\nAlign on operational progress, financial structure, and strategic decisions.\n\n## Key Takeaways\n\n1. **Website Live, Payments Blocked:** The website is live with 214 of 416 SKUs, but a non-responsive payments contact is blocking transactions.\n2. **Partner Loans Formalized:** Partner loans will carry 10% interest and be repaid before any partner distributions, formalizing the financial structure.\n3. **Retail Store Paused:** The $200K–$450K CI retail build-out is on hold pending validation of the business model with the first container order.\n4. **Inventory Strategy Refined:** Darryl will discuss the Italian container order with Roberto, using competitive analysis to balance speculative buys (e.g., Brunello) with proven white-space opportunities (e.g., Rosé).\n\n## Topics\n\n### Website & Inventory Status\n- Website is live with 214 of 416 SKUs, featuring descriptions and pricing\n- Inventory is managed in Cin7, which is now the single source of truth for stock levels\n- **Blocker:** A non-responsive payments contact is preventing the site from accepting transactions\n\n### Financial Structure & Partner Loans\n- Partner loans will carry 10% interest to ensure fairness, as partners contribute varying amounts of capital and sweat equity\n- Loans will be repaid before any partner distributions (dividends/draws)\n- **Rationale:** This structure formalizes the financial relationship and prevents future resentment\n\n### Italian Container Order Strategy\n- Roberto's proposed order includes Brunellos and Barolos, but competitive analysis shows Mario already dominates this market with better distribution\n- **Risk:** These wines are slower-moving, risking high inventory holding costs\n- **Opportunity:** The analysis identified white-space categories like Rosé for higher-margin sales\n- **Strategy:** Combine low-margin, high-volume wholesale orders to fill containers with high-margin, speculative buys for private clients\n- **Logistics:**\n  - Container freight: ~$1.30/bottle (33-day lead time)\n  - DHL freight: ~$18/bottle (3–5 day lead time) for urgent, high-value private client orders\n\n### Purchasing Validation Process\n- A formal process is needed to validate speculative inventory buys and prevent excessive stock build-up\n- Dwayne shared a document with 13 validation ideas, including:\n  - **Vivino Demand Signals:** Check if a wine has consumer ratings, indicating market demand\n  - **Competitor Cross-Reference:** Analyze competitor pricing and margins\n  - **Pre-Order Requirements:** Prioritize wines with confirmed sales\n  - **AI Scoring:** Use AI to assess market viability\n\n### Retail Store Decision\n- The retail store project is paused due to the significant financial commitment ($200K–$450K CI build-out + inventory)\n- **Rationale:** Validate the core business model with the first container order before committing to a large, long-term investment\n- **Compromise:** Kyle will continue scouting locations. If a \"dream\" spot is found, the partners will consider paying rent (~$10K/month) to secure it, even if the build-out is delayed\n\n### Operational Updates\n- **Warehouse Renovation:** Progressing on budget with cost-saving measures (e.g., using leftover LED light rails)\n- **Vans:** Both vans are purchased. One is for Roberto's daily use, and the other is a dedicated delivery vehicle\n- **Company Cards:** Two cards will be issued — one for Kyle (online purchases) and one for the office (local expenses)\n  - **Policy:** All charges require a receipt with context, tracked by Tallyn and reviewed by Mika\n\n### Reporting & KPIs\n- Roberto will not provide direct reports\n- **Process:** Tallyn will ensure all sales are accurately entered into Cin7, making it the single source of truth\n- Mika will then pull automated reports from Cin7's API\n- Darryl will define the top 3 KPIs for a weekly automated report\n\n## Next Steps\n\n### Darryl\n- Send partner agreements via DocuSign\n- Discuss the Italian container order, purchasing validation ideas, and sales tracking with Roberto\n- Brief Tallyn on the new Cin7 sales entry process\n- Define the top 3 KPIs for the weekly automated report\n\n### Kyle\n- Finalize company card applications\n- Continue scouting retail locations but do not sign a lease without partner approval\n\n### Dwayne\n- Provide the dark blue paint color code for the warehouse renovation\n"
  },
  {
    "date": "2026-02-09",
    "title": "Tallyn — Contract & Ops Check-In",
    "filename": "2026-02-09-tallyn-contract-ops-checkin.md",
    "content": "# Tallyn — Contract & Ops Check-In\n\n**Date:** February 9, 2026, 9:58 AM\n**Duration:** 17 minutes\n**Participants:** Dwayne, Tallyn, Kyle\n\n---\n\n## Container Shipment Logistics & Process\n\n- A **40-foot container of wine must ship from Italy by February 26** to arrive in Cayman in time for the Easter rush\n- Roberto will recommend the products to include and provide pro formas and purchase orders to Tallyn\n- Roberto is negotiating **bulk-order and prepayment discounts (5–20%)** with Italian producers\n- **This shipment is mostly speculative** — only ~6 of 21-22 pallets are pre-sold. The rest is Roberto's recommendations based on market knowledge\n\n## Future Inventory Strategy\n\n- For future containers (March, April, May), target **50% of contents pre-sold**\n- \"Pre-sold\" = formal PO or verbal agreement\n- Remaining 50% can be speculative but **each SKU must have documented rationale**\n- Dwayne believes Cin7 can flag SKUs as \"pre-sold\" or \"speculative\"\n- More structured process to be implemented for future orders\n\n## Tallyn's Compensation & Role\n\n- **Primary role:** Administration\n- **Base salary:** $48,000 CI/year + health insurance\n- **Commission on new sales relationships Tallyn brings** (top-line revenue):\n  - Year 1: 5%\n  - Year 2: 3%\n  - Year 3: 1%\n- Partners hope this could allow Tallyn to earn **up to $100,000 CI/year**\n- **Formal review after 6-month probation** to reassess base salary\n- Tallyn expressed initial agreement, will confirm next day\n\n## Future Role Development & Automation\n\n- Partners aim to **automate much admin work using AI** (being developed by Dwayne)\n- As admin tasks become automated, Tallyn's role could **shift toward sales support**\n- Long-term goal: sales support role to assist Roberto — Tallyn could transition into this\n- All parties acknowledge startup roles will evolve\n\n## Inventory Scanning & SKU Management\n\n- All bottles of the same wine share the same barcode/SKU\n- **Vintage (year) must be tracked separately** — barcode alone isn't sufficient\n- **Scan cases and input quantity** rather than scanning every individual bottle\n\n## Action Items\n\n| Owner | Action | Deadline |\n|-------|--------|----------|\n| Tallyn | Review compensation proposal and confirm via WhatsApp | Feb 10 |\n| Kyle (Speaker 1) | Prepare and send formal employment agreement for DocuSign | This week |\n| Tallyn + Dwayne + Kyle | Set up ad-hoc tracking (Google Sheet) for Feb 26 container contents + Roberto's rationale for speculative SKUs | ASAP |\n\n## AI-Flagged Open Issues\n\n1. **Ad-hoc tracking method for Feb 26 container not yet defined** — need clear process between Tallyn, Dwayne, and Kyle to prevent miscommunication\n2. **Documenting Roberto's rationale for speculative inventory** — the long-term plan is Cin7, but the immediate method for this shipment is unclear\n\n---\n\n*Source: Plaud.ai recording*\n"
  },
  {
    "date": "2026-02-07",
    "title": "7 Cellars Partner Chat - Launch Logistics & Financials",
    "filename": "2026-02-07-partner-chat-launch-logistics.md",
    "content": "# 7 Cellars Partner Chat - Launch Logistics & Financials\n\n**Date:** February 7, 2026  \n**Duration:** 113 minutes  \n**Source:** [Fathom Recording](https://fathom.video/share/XxhS97mwhW5T9V3ydDeWjfNzzKgss2SB)  \n**Attendees:** Dwayne Schofield, Darryl Hicks, Kyle Klischuk, (Talon discussed)\n\n---\n\n## Meeting Purpose\nFinalize launch logistics, financial risks, and team compensation.\n\n---\n\n## Key Takeaways\n\n1. **Talon's Comp Model:** A performance-based model was approved: 48k CI base salary + 5% commission on net new sales, capped at 100k CI total compensation.\n\n2. **Inventory & Cashflow:** To manage cashflow, new container orders will target 50% pre-sold inventory. Talon will also establish landed costs for the initial 300k CI inventory.\n\n3. **Operational Systems:** Key systems being implemented: feature-rich website, SIN7 inventory management system, and QuickBooks Online for accounting.\n\n4. **Strategic Branding:** Kyle will lead a brand refresh, including new workstations, office furniture, and a new van to project a high-end image on the island.\n\n---\n\n## Topics\n\n### Financial Risks & Controls\n\n#### Vino Veritas Acquisition\n- The Letter of Intent (LOI) will be formalized into a binding Asset Purchase Agreement (APA) to legally close the deal\n- **Action:** Darryl to draft and circulate the APA\n\n#### Initial Inventory Valuation\n- Talon will establish landed costs for the 300k CI of acquired inventory, critical for calculating the 50/50 profit share with Roberto\n- **Process:**\n  - **SKU Capture:** Use a working barcode scanner (not manual entry) to add SKUs to the inventory spreadsheet\n  - **Cost Determination:** Use Roberto's records. If unavailable, research current wholesale prices and apply a discount (e.g., 5-10%) to reflect Roberto's historical ability to secure better deals\n  - **Consignment Tracking:** In SIN7, tag all acquired inventory as \"consignment\" to enable separate reporting for profit-share calculations\n\n#### Container Procurement Policy\n- **Goal:** Mitigate cashflow risk from unsold inventory, preventing a repeat of the current 300k CI situation\n- **Policy:** A soft target of **50% pre-sold inventory** (verbal commitments are acceptable for now) for all new container orders\n- **Documentation:** Talon will track the pre-sold percentage and Roberto's rationale for speculative SKUs within SIN7\n\n---\n\n### Operational Systems & Tools\n\n#### Website & E-commerce (Dwayne)\n- The new website is feature-rich, including an AI wine finder, cellar consultation booking, and a \"Yacht Provisioning\" page for positioning\n- **Feedback:**\n  - Add multiple wine scores (e.g., Vivino, Wine Spectator) to product pages\n  - Revise the \"Our Story\" page to highlight the full sommelier team (including Master Somm Bram Baldwin) and explain the value of a Master Somm\n  - Align the website's visual tone with the fun, lifestyle-focused Instagram feed\n- **B2B Portal:** A Shopify B2B portal is a future option for consistent branding, but the current focus is on the retail site\n\n#### Inventory Management (SIN7)\n- SIN7 is purchased; Dwayne and Talon will complete the mandatory 4-week training\n- **Capabilities:**\n  - Centralized inventory tracking (on-hand, in-transit, multi-warehouse)\n  - Automated reorder prompts based on minimum stock levels\n  - AI-pulled tasting notes and scores for all wines\n\n#### Accounting (QuickBooks Online)\n- Kyle will add 7 Cellars as a company to his existing QuickBooks Online account\n- **Action:** Kyle to provide Darryl access to set up the chart of accounts\n\n#### Knowledge Base & SOPs (Plodbot)\n- Talon will record conversations with Roberto and upload them to Plodbot\n- **Goal:** Use the AI to analyze these recordings and automatically generate Standard Operating Procedures (SOPs) for key processes like container ordering\n\n---\n\n### Team & Compensation\n\n#### Talon's Performance-Based Compensation\n- **Model:** Base salary of 48k CI + 5% commission on net new sales\n- **Cap:** Total compensation is capped at 100k CI\n- **Rationale:** Incentivizes sales while ensuring admin duties are completed, and builds redundancy in the sales function\n\n#### Office & Branding Refresh (Kyle)\n- Kyle will lead a refresh to project a high-end image\n- **Budget:** Kyle will prepare a budget for new workstations, office furniture (e.g., stand-up desks), and a new, branded delivery van\n- **Funding:** Kyle will fund any costs exceeding the initial 5k CI setup budget, earning 10% interest on the shareholder loan\n\n---\n\n## Action Items\n\n### Darryl\n- [ ] Draft and circulate the Asset Purchase Agreement (APA)\n- [ ] Set up the 7 Cellars chart of accounts in QuickBooks Online\n- [ ] Create and assign Trello tasks from the meeting notes\n- [ ] Draft Talon employment contract incl. 5% new-biz commission (cap 100k CI)\n- [ ] Schedule call w/ Roberto re: container contents + pre-sold commitments\n- [ ] Create Trello board for next partner meeting agenda\n- [ ] Move Fathom action items to Trello; assign owners/dates; notify via WhatsApp\n- [ ] Draft and send Shoreline–Seven Sellers loan agreement\n\n### Kyle\n- [ ] Provide Darryl access to the 7 Cellars QuickBooks Online account\n- [ ] Prepare a budget for the office and branding refresh\n- [ ] Action the lease signing for the office space\n- [ ] Buy 2 office workstations in Miami; set up in office\n- [ ] Quote/order office furniture + van wrap; send budget to Darryl\n- [ ] Set up QBO for 7 Sellers; add Darryl; share creds\n- [ ] Source small fridge for caviar storage\n- [ ] Email Cindy's contact info to Kyle; sign lease\n\n### Dwayne\n- [ ] Review Darryl's write-up\n- [ ] Implement website feedback:\n  - Add multiple wine scores (Vivino, Wine Spectator, etc.) to product pages\n  - Revise \"Our Story\" page to highlight full sommelier team + Master Somm Bram Baldwin\n  - Add cellar-build copy\n  - Set Roberto booking link\n- [ ] Set up info@7cellars.ky distribution list (auto-forward to Roberto + Talon)\n- [ ] Email Roberto re: Dec hosting invoice; request payment\n- [ ] Coordinate with Talon on SIN7 training and setup\n- [ ] Source wheeled cooler + ice packs for caviar delivery\n\n### Talon\n- [ ] Fix barcode scanner; scan SKUs; add consignment tag in SIN7\n- [ ] Coord landed costs w/ Roberto\n- [ ] Record all meetings w/ Roberto; upload to Plod\n- [ ] Email Papagallo's for testimonial authorization\n\n---\n\n## Notes\n\n- Master Sommelier Bram Baldwin should be highlighted on the website\n- The website should match the \"fun, lifestyle-focused\" vibe of the Instagram feed\n- B2B Shopify portal is future consideration, retail site is priority now\n- 50% pre-sold target for new containers to manage cashflow risk\n"
  },
  {
    "date": "2026-02-05",
    "title": "Exploring a Partnership: A Tour of a Luxury Residence and Seven Cellars' Value Proposition",
    "filename": "2026-02-05-luxury-residence-partnership.md",
    "content": "# Exploring a Partnership: A Tour of a Luxury Residence and Seven Cellars' Value Proposition\n\n**Date:** 2026-02-05 11:09:25  \n**Duration:** 2h 27m 9s  \n**Participants:** Kyle Klischuk (Seven Cellars), Roberto, Residence Representatives\n\n---\n\n## Summary\n\nA tour of a high-end residential property serves as the backdrop for a business discussion with Seven Cellars, exploring a potential partnership to cater to the property's exclusive clientele. The conversation blends a detailed walkthrough of the facility's luxurious amenities with a pitch on providing bespoke, high-end wine and beverage services.\n\n---\n\n## Meeting Notes\n\n### 1. Introduction to the Luxury Residence and its Owner-Centric Model\n\nThe facility spans just under 7,000 square feet and operates on a strata system where all units and common areas are owned directly by the residents. This structure fosters a highly exclusive environment with amenities including:\n- Veranda and expansive barbecue areas\n- Pizza oven\n- State-of-the-art techno yoga studio\n- On-site treatment services\n- Stringent security (only owners and verified guests)\n\n**Planned Experiences:**\n- Securing a yacht for residents\n- Michelin-starred chef residencies (one-star chef from London scheduled for November)\n- \"Social Sunday\" and \"Sun Soiree\" gatherings\n- Dedicated pastry chef (Faheem) and sous-chef (Chantal)\n\n### 2. Seven Cellars' Business Pitch and Value Proposition\n\nKyle Klischuk presented Seven Cellars as an ideal partner:\n- Formed by successful business partners with a passion for wine\n- Roberto as expert sommelier, Partner and Head of Sales\n- Relationship-driven model leveraging Roberto's multilingual negotiation skills\n- Current inventory: **260 distinct lines**\n\n**Core Mission:** Be the reliable \"go-to\" provider for niche, difficult-to-source products for the increasingly sophisticated Cayman market. Built on operational excellence and strong producer relationships.\n\n**Key Example:** French Bloom (premium non-alcoholic beverage) — aligns with contemporary luxury trends.\n\n### 3. In-Depth Tour of Exclusive Spa and Wellness Facilities\n\nThe spa epitomizes bespoke luxury:\n- All elements custom-made (millwork, tiles)\n- Privacy glass (see out, can't see in)\n- Automatic music and lighting adjustments throughout the day\n- Call-button service for immediate assistance\n\n**Membership Tiers:**\n- **Founder:** Top-tier, 24-hour access\n- **Emerald:** 100 members\n- **Jade:** 200 members\n- **Current waiting list:** 600 individuals\n- Corporate packages available\n\nThe space can host weddings, private board meetings, and more. Already recognized in *Forbes* for its \"glow-up oil.\" No comparable facility in the region.\n\n### 4. Discussion of Synergies and Service Integration\n\n**Residence Needs:**\n- Dependable partner to source unique, difficult-to-find items\n- Remove logistical burden from clients\n\n**Seven Cellars Commitment:**\n- Reputation relies on flawless performance and reliability\n- \"Would never let the client down\"\n\n**French Bloom** was well-received as a \"super sexy\" product — great introduction to the partnership.\n\n> \"The best deals are always done when there's no money in exchange.\" — on synergistic relationships\n\n---\n\n## Action Items\n\n- [ ] **Kyle/Seven Cellars:** Send information or sample of French Bloom product\n- [ ] **Residence Rep:** Send message to cousin (fisher) and contact other party\n\n---\n\n## Key Takeaways\n\n- Strong alignment of values between Seven Cellars and the luxury residence\n- French Bloom as entry point to partnership\n- Residence has high-end clientele with sophisticated tastes — perfect fit for Seven Cellars' model\n- Membership demand is high (600 waitlist) — significant opportunity\n\n---\n\n*Source: Plaud.ai recording*\n"
  },
  {
    "date": "2026-02-04",
    "title": "7 Cellars Operational Catch Up",
    "filename": "2026-02-04-operational-catch-up.md",
    "content": "# 7 Cellars Operational Catch Up\n\n**Date:** 2026-02-04 11:47:44  \n**Duration:** 20m 39s  \n**Participants:** Speaker 1, Speaker 2, Speaker 3, Speaker 4, Speaker 5\n\n---\n\n## Meeting Notes\n\n### 1. Pricing and Landed Cost Review for Private Cuvée Prosecco\n- Calculated net price after discounts: €2.51\n- Duty added: $5.80; freight/logistics: ~$1.30–$1.40\n- Landed cost cited around $9.35–$9.71\n- Wholesale target price near $12.80–$13.00 after ~30% margin\n- **Rationale:** Keep price just under $13 to drive volume and retain accounts\n- **Conclusion:** Team aligns on ~$12.80 wholesale for Prosecco private cuvée\n\n### 2. Current Orders and Pre-Sold Inventory\n- Seven pallets committed: 5 private cuvées, 1 Prosecco, 1 Sauvignon Blanc\n- Sauvignon Blanc margin estimated at >30%; exact numbers not on hand\n- Active deliveries to clients (e.g., Baccaro, Reeds; Macono GZ two cases)\n- Need to coordinate with F&B at Reeds for restaurant Andiamo (Sambarolo and Gabi)\n- **Conclusion:** Existing commitments in place; further coordination needed with F&B\n\n### 3. Container Planning and February Payment Process\n- **Containers:** 40-foot from Italy; 20-foot from France\n- **Goal:** Fill by Friday; champagne urgency to avoid Easter stock-out\n- **Temporary February plan:** Transfer funds to Vino Veritas; Roberto pays suppliers\n- **Banking concern:** European (especially French) banks may block payments from different accounts\n- **Conclusion:** Use Vino Veritas for February payments; Roberto to confirm bank acceptance\n\n### 4. SKU List and Approval Workflow for Container Filling\n- Roberto to propose \"perfect SKUs\" and costs for Italian (and French if possible) containers\n- Include pre-sold SKUs and high-confidence fast movers\n- Potential inclusion of Bordeaux/Burgundy higher price points; defer to Roberto's judgment\n- One-off rapid approval for this order; future process to be refined\n- **Conclusion:** Roberto will send SKU list promptly; team aims to rubber-stamp with minor questions\n\n### 5. Armagnac and Customization Options\n- Christophe provided Armagnac vintages list\n- **Options:** 5-liter vintage with pipette service; personalized engraving/private labels\n- Prepared for tomorrow's meeting with Watermark; viewed as a strong offering\n\n### 6. Non-Alcoholic \"French Bloom\" Sourcing\n- Request to source highest-end non-alcoholic French Bloom\n- **Strategy:** Offer LCL immediate delivery pricing vs. consolidated shipment timing\n\n### 7. Meeting with Sean at Watermark and Sales Approach\n- **Plan:** Kyle and Roberto to meet Sean tomorrow at Watermark\n- Sean wants true white-glove service; deal not yet closed\n- **Approach:** Listen to needs, propose curated wine list with timelines (33–35 days)\n- Aim for a quick \"win\" by fulfilling a specific ask\n- Leverage relationships (Paul, Frazier, Leroy) and past performance in complex projects\n- **Conclusion:** Team aligned on consultative, proof-by-delivery strategy; meeting is a key sales step\n\n### 8. Systems and Expense Policy (Since7 Platform)\n- Since7 POS/payment portal selected; onboarding $800 mandatory; $349/month subscription\n- E-comm cost noted at $34/month\n- **Proposed expense policy:** Auto-approval for expenses under ~$500/month; sign-off for larger\n- **Goal:** Empower autonomy with guardrails (e.g., opening bottles for prospects)\n- **Conclusion:** Proceed with Since7; develop formal expense policy\n\n---\n\n## Action Items\n\n- [ ] **Roberto:** Send SKU list and ballpark costs for Italian (and French) containers ASAP via email/WhatsApp; include pre-sold SKUs and fast movers, and consider Bordeaux/Burgundy SKUs if feasible\n- [ ] **Roberto:** Confirm European bank acceptance for payments via Vino Veritas in February; define contingency if payments are rejected\n- [ ] **Kyle:** Transfer funds to Vino Veritas for urgent orders; Roberto to forward supplier invoices and bank details\n- [ ] Fill Italian 40-foot container by Friday; prioritize champagne to avoid Easter stock-out; prepare LCL backup with lead times and costs if needed\n- [ ] **Kyle & Roberto:** Meet Sean at Watermark tomorrow; capture specific \"ask,\" propose curated list with 33–35 day timelines, and deliver a quick win\n- [ ] Develop and circulate recommended expense policy (sub-$500/month auto-approval; larger items require sign-off)\n- [ ] Source highest-end non-alcoholic French Bloom; present LCL vs. consolidated options and pricing\n- [ ] Prepare Armagnac proposal with vintage options and personalization (engraving/private labels) for tomorrow's meeting\n- [ ] Coordinate with Reeds F&B for Andiamo (Sambarolo and Gabi) order requirements\n- [ ] Establish a clear, repeatable SKU approval workflow and criteria for future orders beyond this one-off\n- [ ] Consolidate precise landed cost components (duty, freight, logistics) for all SKUs to standardize pricing and margin tracking\n- [ ] Document white-glove service standards for Sean/Watermark (response times, delivery windows, customization, sourcing SLAs)\n\n---\n\n## AI Suggestions (Open Issues)\n\n> ⚠️ Issues that were not concluded or lack clear action items:\n\n1. **Banking constraints:** Clarify whether Vino Veritas can pay suppliers without bank blocks; define contingency if payments are rejected\n2. **SKU approval process:** Establish a clear, repeatable workflow and criteria for future approvals beyond this one-off \"rubber stamp\"\n3. **Champagne supply risk:** Create a backup plan (LCL order) with confirmed lead times and costs to avoid Easter stock-out\n4. **White-glove service definition:** Document service standards for Sean/Watermark (response times, delivery windows, customization, sourcing SLAs)\n5. **Margin tracking:** Consolidate precise landed cost components (duty, freight, logistics) for all SKUs to ensure consistent pricing and margin targets\n\n---\n\n*Source: Plaud.ai recording*\n"
  },
  {
    "date": "2026-02-04",
    "title": "7 Cellars Operational Catch-Up (Post-LOI Sales Operations)",
    "filename": "2026-02-04-roberto-post-loi-sales-operations.md",
    "content": "# 7 Cellars Operational Catch-Up (Post-LOI Sales Operations)\n\n**Date:** 2026-02-04\n**Duration:** 20m 39s\n**Source:** [Plaud.ai Recording](https://web.plaud.ai/s/pub_f700438e-c47c-4eca-9f38-1f48eb62cfd7::0qq_hPMlBtRtKfxYozS0ZVNTYIOBGiYOQKDwercmohquOakkrB8HXSE-_dE_kFR9nMH6jOFMDXA7vCwC)\n\n---\n\n## Meeting Notes\n\n### Pricing and Landed Cost Review for Private Cuvée Prosecco\n\n- Net price after discounts: €2.51\n- Duty added: $5.80; freight/logistics: ~$1.30–$1.40\n- Landed cost: around $9.35–$9.71\n- Wholesale target price: ~$12.80–$13.00 after ~30% margin\n- **Rationale:** Keep price just under $13 to drive volume and retain accounts\n- **Conclusion:** Team aligns on ~$12.80 wholesale for Prosecco private cuvée\n\n### Current Orders and Pre-Sold Inventory\n\n- Seven pallets committed: 5 private cuvées, 1 Prosecco, 1 Sauvignon Blanc\n- Sauvignon Blanc margin estimated at >30%; exact numbers not on hand\n- Active deliveries to clients (e.g., Baccaro, Reeds; Macono GZ two cases)\n- Need to coordinate with F&B at Reeds for restaurant Andiamo (Sambarolo and Gabi)\n- **Conclusion:** Existing commitments in place; further coordination needed with F&B\n\n### Container Planning and February Payment Process\n\n- Containers: 40-foot from Italy; 20-foot from France\n- **Goal:** Fill by Friday; champagne urgency to avoid Easter stock-out\n- **Temporary February plan:** Transfer funds to Vino Veritas; Roberto pays suppliers\n- **Banking concern:** European (especially French) banks may block payments from different accounts\n- **Conclusion:** Use Vino Veritas for February payments; Roberto to confirm bank acceptance\n\n### SKU List and Approval Workflow for Container Filling\n\n- Roberto to propose \"perfect SKUs\" and costs for Italian (and French if possible) containers\n- Include pre-sold SKUs and high-confidence fast movers\n- Potential inclusion of Bordeaux/Burgundy higher price points; defer to Roberto's judgment\n- One-off rapid approval for this order; future process to be refined\n- **Conclusion:** Roberto will send SKU list promptly; team aims to rubber-stamp with minor questions\n\n### Armagnac and Customization Options\n\n- Christophe provided Armagnac vintages list\n- Options: 5-liter vintage with pipette service; personalized engraving/private labels\n- Prepared for tomorrow's meeting with Watermark; viewed as a strong offering\n\n### Non-Alcoholic \"French Bloom\" Sourcing\n\n- Request to source highest-end non-alcoholic French Bloom\n- Strategy: Offer LCL immediate delivery pricing vs. consolidated shipment timing\n\n### Meeting with Sean at Watermark and Sales Approach\n\n- **Plan:** Kyle and Roberto to meet Sean tomorrow at Watermark\n- Sean wants true white-glove service; deal not yet closed\n- **Approach:** Listen to needs, propose curated wine list with timelines (33–35 days)\n- Aim for a quick \"win\" by fulfilling a specific ask\n- Leverage relationships (Paul, Frazier, Leroy) and past performance in complex projects\n- **Conclusion:** Team aligned on consultative, proof-by-delivery strategy; meeting is a key sales step\n\n### Systems and Expense Policy (Since7 Platform)\n\n- Since7 POS/payment portal selected; onboarding $800 mandatory; $349/month subscription\n- E-comm cost noted at $34/month\n- **Proposed expense policy:** Auto-approval for expenses under ~$500/month; sign-off for larger\n- **Goal:** Empower autonomy with guardrails (e.g., opening bottles for prospects)\n- **Conclusion:** Proceed with Since7; develop formal expense policy\n\n---\n\n## Next Arrangements\n\n- [ ] Roberto to send SKU list and ballpark costs for Italian (and French) containers ASAP; include pre-sold SKUs and fast movers, and consider Bordeaux/Burgundy SKUs if feasible\n- [ ] Confirm European bank acceptance for payments via Vino Veritas in February; define contingency if payments are rejected\n- [ ] Kyle to transfer funds to Vino Veritas for urgent orders; Roberto to forward supplier invoices and bank details\n- [ ] Fill Italian 40-foot container by Friday; prioritize champagne to avoid Easter stock-out; prepare LCL backup with lead times and costs if needed\n- [ ] Kyle and Roberto to meet Sean at Watermark tomorrow; capture specific \"ask,\" propose curated list with 33–35 day timelines, and deliver a quick win\n- [ ] Develop and circulate recommended expense policy (sub-$500/month auto-approval; larger items require sign-off)\n- [ ] Source highest-end non-alcoholic French Bloom; present LCL vs. consolidated options and pricing\n- [ ] Prepare Armagnac proposal with vintage options and personalization for tomorrow's meeting\n- [ ] Coordinate with Reeds F&B for Andiamo (Sambarolo and Gabi) order requirements\n- [ ] Establish a clear, repeatable SKU approval workflow and criteria for future orders\n- [ ] Consolidate precise landed cost components (duty, freight, logistics) for all SKUs to standardize pricing and margin tracking\n- [ ] Document white-glove service standards for Sean/Watermark (response times, delivery windows, customization, sourcing SLAs)\n\n---\n\n## AI Suggestions (Unresolved Items)\n\n- **Banking constraints:** Clarify whether Vino Veritas can pay suppliers without bank blocks; define contingency if payments are rejected\n- **SKU approval process:** Establish a clear, repeatable workflow and criteria for future approvals beyond this one-off \"rubber stamp\"\n- **Champagne supply risk:** Create a backup plan (LCL order) with confirmed lead times and costs to avoid Easter stock-out\n- **White-glove service definition:** Document service standards for Sean/Watermark (response times, delivery windows, customization, sourcing SLAs)\n- **Margin tracking:** Consolidate precise landed cost components (duty, freight, logistics) for all SKUs to ensure consistent pricing and margin targets\n"
  },
  {
    "date": "2026-01-29",
    "title": "7 Cellars Partner Call — January 29, 2026",
    "filename": "2026-01-29-partner-call.md",
    "content": "# 7 Cellars Partner Call — January 29, 2026\n\n**Date:** January 29, 2026\n**Duration:** 60 minutes\n**Source:** [Fathom Recording](https://fathom.video/share/yi7Zx93F_gxQMxMKANxfeeMEeC4HTX_c)\n\n---\n\n## Meeting Purpose\n\nAlign on 90-day objectives, define roles, and review legal structures.\n\n## Key Takeaways\n\n- **90-Day Objectives Defined:** Darryl (Legal/Finance), Kyle (Operations), and Dwayne (Tech/Marketing) will lead the initial setup sprint to June, aiming for system stability and profitability to fund future hires.\n- **Talent Identified:** Talon, an operations pro, is a strong candidate; Kyle will research market salary to prepare an offer.\n- **Legal Framework Set:** A non-binding MOU ensures equal economic partnership despite Kyle's 60% legal ownership (required by Cayman law). An interim plan will use Shoreline Ltd. as a temporary vehicle.\n- **Tech Stack Chosen:** CIN7 will be the back-office system of record for wholesale inventory, while Shopify will power the retail e-commerce front end.\n\n## Topics\n\n### 90-Day Objectives & Partner Roles\n- **Goal:** Establish a clear 90-day sprint (to June) for initial setup and systemization\n- **Rationale:** This sprint aims to achieve operational stability and profitability, enabling the business to fund a future Director of Operations/GM hire\n- **Partner Roles & Capacity:**\n  - **Darryl (Legal/Finance):** Finalize Roberto's M&A deal, formalize all contracts (employment, supplier), and create operational playbooks. Flexible hours weekly.\n  - **Kyle (Operations):** Lead operational readiness — inventory management, license migration, bank accounts, delivery logistics. 2–3 hours/day.\n  - **Dwayne (Tech/Marketing):** Build the digital infrastructure (Shopify, CIN7) and lead brand development. Full-time until June.\n\n### Roberto M&A & Onboarding\n- **Deal Status:** Structure finalized. If inventory sales meet projections, acquisition cost effectively zero.\n- **Risk Mitigation:** Agreement allows parting ways within 12 months without equity cost.\n- **Action:** Kyle will meet with Roberto today to nudge agreement signing before Feb 1 deadline.\n- **Onboarding Plan:**\n  - Deliveries: Shift to fixed schedule (e.g., 3 days/week) for ~80% of deliveries\n  - Email: `roberto@7cellars.ky` created; credentials sent upon deal signing\n  - Website: `vino.ky` domain will redirect to new 7cellars site\n\n### Talent Acquisition: Talon\n- Strong alignment with operational role — experience with inventory, logistics, QuickBooks Online\n- Kyle will contact headhunters (Greenlight RE, Invenio) and Heidi to research market salary\n- Team will prepare formal offer based on salary research\n\n### Legal & Governance Framework\n- **MOU for Partnership Intent:**\n  - Non-binding moral agreement ensuring equal economic partnership (1/3 each) despite Kyle's 60% legal ownership (required by Cayman law)\n  - ESOP: 10% pool (5% for Roberto, 5% reserved)\n  - Distributions: Net financial benefit will approximate an equal split\n  - Shareholder Loans: 10% annual interest, repaid before any profit distributions\n  - Exit Pledge: Kyle pledges to accept offers in best interest of all partners and ensure equal proceeds\n- **Shareholders Agreement (USA):**\n  - Board: Kyle is sole director; Darryl and Dwayne are non-voting observers\n  - Veto Rights: Darryl and Dwayne have veto power over material decisions (e.g., changing articles, liquidation, related-party transactions >$5k)\n  - Share Transfers: Standard tag-along and drag-along rights\n- **Interim Plan:** Use Shoreline Ltd. as temporary vehicle until 7cellars is incorporated. Darryl will draft one-page MOU.\n\n### AI & Tech Stack\n- Dwayne setting up local ClaudeBot instance on Mac Mini as 24/7 virtual employee\n- **CIN7:** Back-office system of record for wholesale inventory and sales\n- **Shopify:** Front-office platform for retail e-commerce\n- **Credit Card:** Dwayne will use personal card to launch subscriptions, migrating to company card once available\n\n## Next Steps\n\n- **Kyle:**\n  - Conduct inventory and take bottle photos with Roberto today\n  - Research market salary for operations role (contact Greenlight RE, Invenio, Heidi)\n  - Discuss M&A agreement with Roberto to encourage signing before Feb 1\n- **Dwayne:**\n  - Launch Shopify and CIN7 subscriptions using personal credit card\n  - Send `roberto@7cellars.ky` credentials upon deal signing\n- **Darryl:**\n  - Draft one-page MOU for interim use of Shoreline Ltd.\n  - Update Shareholders Agreement (USA) to reflect voting shares for all partners\n- **All:**\n  - Prepare formal offer for Talon after salary research\n  - Schedule recurring weekly partner call\n\n## Action Items\n\n- [ ] Print Roberto agreement; bring to inventory; discuss/sign — *Kyle Klischuk*\n- [ ] Check weather; confirm travel to Cayman next week — *Dwayne Schofield*\n- [ ] Schedule weekly partner sync w/ Kyle & Dwayne — *Darryl Hicks*\n- [ ] Draft/document vendor and customer agreements — *Darryl Hicks*\n- [ ] Create playbooks/templates for ops; then have Talon extract knowledge from Roberto — *Kyle Klischuk*\n- [ ] Set up 80/20 delivery cadence w/ Roberto; then implement — *Kyle Klischuk*\n- [ ] Start Vino Veritas license migration to 7cellars — *Kyle Klischuk*\n- [ ] Open 7cellars bank account — *Kyle Klischuk*\n- [ ] Add Talon tab to expense tracker — *Darryl Hicks*\n- [ ] Launch Shopify w/ personal card; migrate to company card when available — *Dwayne Schofield*\n- [ ] Call Heidi & Greenlight RE re: Talon salary; then send offer — *Kyle Klischuk*\n- [ ] Draft 1-page interim Shoreline MOU; send to Kyle & Dwayne for signature — *Darryl Hicks*\n- [ ] Get Roberto hosting creds; then redirect vino.ky to 7cellars — *Dwayne Schofield*\n"
  },
  {
    "date": "2026-01-20",
    "title": "Roberto & Sharon - Vino Veritas Deal Terms",
    "filename": "2026-01-20-roberto-sharon-deal-terms.md",
    "content": "# Roberto & Sharon - Vino Veritas Deal Terms\n\n**Date:** 2026-01-20\n**Duration:** 6m 25s\n**Source:** [Plaud.ai Recording](https://web.plaud.ai/s/pub_36c2ee58-d8fd-485e-bbe6-76a73484af72::0goF38aTotksq-Hv6dfpA1vCfqEYGKu9bWpnzHCfsPKWoCTKfE1YDnBCTxAVzIVoFhI9XDisJFVDls0C)\n\n---\n\n## Meeting Notes\n\n### Partnership Terms and Compensation Structure\n\n- **Goal:** Finalize remaining details to set the partnership up for success in 2026.\n- **Agreed components:**\n  - Base salary, commissions, and target total compensation around $130,000 CI per year\n  - 5% profit share in 7 Cellars, provided annually\n  - 5% equity ownership in 7 Cellars, vesting over time\n  - Equity intended to include participation in future brand or asset sales per 5% ownership\n- **Outstanding item:** Upfront payment and inventory profit split.\n\n### Upfront Payment and Inventory Profit Sharing Proposals\n\n- **Proposal A:**\n  - $70,000 USD one-time signing bonus\n  - 50/50 profit split on inventory sales\n  - At 6 months, any unsold inventory will be purchased at cost, with a one-time payment to the seller\n- **Proposal B:**\n  - $100,000 USD upfront payment\n  - 30/70 profit split on inventory sales (30% to the seller, 70% to 7 Cellars)\n  - All other terms are the same as Proposal A\n- **Rationale:** Offer choices based on preferred upfront amount with corresponding inventory profit share.\n\n### Coordination and Next Steps\n\n- Roberto will review with Sharon before deciding.\n- **Request:** Receive both proposals in writing.\n- **Darryl's availability:**\n  - Flight to Los Angeles at 4:30 p.m. Eastern; available for calls between 2:30–4:30 p.m. at the airport\n  - Available after landing around 8:00–8:30 p.m. Eastern\n  - Dwayne or Kyle can also discuss and keep Darryl posted\n\n---\n\n## Next Arrangements\n\n- [ ] Send the written proposal outlining both options (A: $70k + 50/50; B: $100k + 30/70)\n- [ ] Define who will send the written proposal and set an expected response deadline\n- [ ] Roberto to discuss proposals with Sharon and provide feedback/decision\n- [ ] Confirm whether the profit split applies only to inventory sales or broader revenue\n- [ ] Document the vesting schedule for the 5% equity (timing, conditions)\n- [ ] Specify the valuation method and treatment for unsold inventory at the 6-month mark\n- [ ] Schedule a call with Darryl (or Dwayne/Kyle) during Darryl's stated availability\n\n---\n\n## AI Suggestions (Unresolved Items)\n\n- Clarify the currency noted as \"130,000 CIE\" to ensure accurate compensation details\n- Confirm whether profit split applies solely to inventory sales or includes broader business revenue\n- Document the vesting schedule details for the 5% equity (timing, conditions)\n- Specify the exact treatment and valuation method for unsold inventory at the 6-month mark\n- Define communication protocol on who sends the written proposal and the expected response deadline\n"
  },
  {
    "date": "2026-01-17",
    "title": "Roberto - Vino Veritas Sales Diligence",
    "filename": "2026-01-17-roberto-sales-diligence.md",
    "content": "# Roberto - Vino Veritas Sales Diligence\n\n**Date:** 2026-01-17\n**Duration:** 47m 25s\n**Source:** [Plaud.ai Recording](https://web.plaud.ai/s/pub_d566d662-7efe-4879-b00a-521b9b95408e::Snl5eow5YH7Jj7ixIUTtxrjKMoIwn9XD4UFGTk4EFCenrSXhWpnNwnNJFi8GMZ1EcDCC8B0xKx_1SmEC)\n\n**Keywords:** Wine Distribution, Sales Projections, Market Strategy\n\n---\n\n## Meeting Notes\n\n### Review of Business Operations and Partnership Proposal\n\n- An offer has been extended to Roberto to partner with Seven Cellars Partners; the goal of this meeting is to align on key points.\n- **Consensus:** Roberto's strengths are client-facing roles and procurement relationships.\n- Partners will initially support operations until a general manager is hired.\n\n### Financial Modeling and Sales Targets\n\n- Viability of reaching 1,300 cases/month was discussed; the model must reflect a mix of low-cost SKUs (e.g., Prosecco) and premium wines (e.g., Bordeaux, Super Tuscans).\n- Current sales split is 60% private buyers and 40% restaurants; this is expected to reverse as the business scales.\n- Roberto emphasized complexity in wine margins; profitability depends on sourcing unique or older vintages not widely available.\n- **Key insight:** \"Case value matters more than volume: 1,300 cases of Prosecco differs significantly from 1,300 cases of high-end Bordeaux.\"\n\n### Market Position and Opportunities\n\n- Large local competitors struggle to introduce new wine lines, creating openings for new products.\n- Prosecco is identified as a high-demand, foundational SKU; the supplier is open to a line of still wines at favorable pricing.\n- Potential opportunity to supply Clementina Cosetti wines (not currently in the US market) at a later date.\n- Key relationships with clients like Grand Old House and potential work with Marketplace restaurants were highlighted as near-term opportunities.\n\n### Operational Needs and Challenges\n\n- Immediate support needed in delivery and marketing.\n- The website is not generating online orders, indicating a need for technical improvements; partners have relevant expertise.\n- Restaurants often face storage constraints and may request supplier warehousing of purchased wine.\n- **Seasonal demand:** Best time to offer vintage wines to restaurants is May/June for the next season; February–June is slower.\n- Major distributors' exclusivity deals (e.g., Jack Scott, CDG) require restaurants to buy 75% from them; competing via unique, high-demand SKUs is a viable strategy to bypass this.\n\n### Inventory Investment and Strategy\n\n- The initial proposal of 100,000 CI/month for inventory is too high at this stage.\n- Roberto suggested approximately $200,000 total over the next five months (February–June), averaging ~$40,000/month.\n- **Investment focus:** A mix including old vintage Burgundy and Bordeaux, Prosecco, and other lines.\n- **Strategy:** Pre-sell as much as possible before placing large orders, especially for high-end vintages.\n- A retail store is a significant future investment that could drive sales but requires substantial inventory.\n\n---\n\n## Next Arrangements\n\n- [ ] Summarize and distribute the meeting notes to participants.\n- [ ] Partners to reconvene to discuss the new information and provide a response.\n- [ ] Roberto to place an order for the European market by month-end to restock Prosecco and other wines.\n- [ ] Group working session to create a detailed business plan once the partnership is finalized.\n\n---\n\n## AI Suggestions (Unresolved Items)\n\n- A specific, agreed initial monthly inventory budget was not finalized. The discussion landed on ~$40,000/month for the next five months, but this remains a high-level estimate rather than a firm starting figure.\n- The path to scale from ~$40,000/month inventory spend to the target of $100,000/month is unclear. Required factors (e.g., new relationships, retail store opening) were mentioned but not quantified.\n- While the need for marketing and delivery support was acknowledged, there are no concrete next steps or budget allocations to address these operational gaps.\n"
  },
  {
    "date": "2026-01-13",
    "title": "Roberto & Sharon - Employment Agreement & LOI Negotiation",
    "filename": "2026-01-13-roberto-sharon-employment-agmt-loi.md",
    "content": "# Roberto & Sharon - Employment Agreement & LOI Negotiation\n\n- **Date:** 2026-01-13\n- **Duration:** 49m 12s\n- **Participants:** Roberto, Sharon, Darryl, Kyle\n- **Source:** [Plaud.ai Recording](https://web.plaud.ai/s/pub_0374cb09-0966-4b36-ab43-1bfd12222437)\n\n## Keywords\n\n`Roberto's Role` · `Compensation Package` · `Business Acquisition` · `Contract Terms` · `Market Expansion` · `Inventory Sales`\n\n---\n\n## Meeting Notes\n\n### Business Acquisition and Strategy\n\n- Core objective: acquire existing wine business and scale to **$4-$5 million in annual revenue** as quickly as possible\n- Plan to sell approximately **1,300 cases of wine per month**, blending high-end and affordable wines\n- 7 Cellars plans significant capital investment: **150,000-180,000 CI per month** for inventory, freight, and duties\n- 7 Cellars will prioritize sale of existing inventory and purchase remaining stock at landed cost after six months — estimated **225,000 CI for Roberto**\n- Offer of **70,000 US for goodwill and assets** (including van), increased from initial 50,000 US — sellers felt this was low, will counter\n- Key logistics advantage: opportunity to transfer **Vino Veritas import licenses** to 7 Cellars at board meeting in **March**\n\n### Market Expansion and Sales Projections\n\n- Concerns raised about whether Cayman market can sustain 1,300 cases/month\n- Roberto expressed confidence, citing strong client relationships, a recent large Prosecco order, and unique opportunities (old vintage Bordeaux/Burgundy wines competitors lack, new clients like One GT and Grand Hyatt)\n- Key suggestion: open a **small, centrally located retail storefront** to increase convenience — current location becomes main warehouse\n\n### Roberto's Role and Employment Agreement\n\n- **Job Role & Title:** Consensus that Roberto's strength is sales/client relations. Title changed from \"General Manager\" to **\"VP Sales and Client Manager\"**. Contract adjusted to remove warehouse work, deliveries, people management duties. \"Fiduciary responsibility\" clause removed.\n- **Operations Management:** Kyle steps into **\"General Manager\" / \"Operations Manager\"** role\n- **Inventory Shrinkage Clause:** Originally held Roberto responsible — clarified it was to cap marketing giveaways (~1% of inventory). Agreed to **remove or rewrite** for clarity.\n- **Vacation and Travel:** One-month vacation acceptable if not during peak season. Business travel for international wine events to be explored.\n\n### Compensation and Payment Structure\n\n**Full Package:**\n- **Base and Commission:** Structure designed to reach **130,000 CI in year one**\n- **Inventory Sale:** Estimated **225,000 CI** from sale of existing inventory\n- **Goodwill/Asset Payment:** One-time payment, under negotiation (initial offer 70,000 US)\n- **Ownership:** **5% ownership stake** in 7 Cellars + **5% quarterly profit share** (projected 50,000-55,000 CI in year one)\n\n**Commission Details:**\n- Paid only after company collects payment from customers (standard practice)\n- Variable commission designed to incentivize rapid sprint to $1.5-$1.7M revenue, then capped\n\n**Payment Cycle:**\n- Monthly commission payment schedule agreed\n- Cayman payment cycles: restaurants typically 15-20 days into following month; hotels and private clients shorter cycles\n\n---\n\n## Next Arrangements\n\n- [ ] Finalize and send revised employment agreement with updated duties, job title, and removal of inventory shrinkage and fiduciary responsibility clauses\n- [ ] Revise commission payment clause to align with monthly payment schedule, considering local collection cycles\n- [ ] Selling party to discuss the 70,000 US goodwill/asset offer internally and propose a counter-number\n- [ ] Acquiring party to respond to the counteroffer by Thursday morning at the latest\n- [ ] Find out the specific date in March for the board meeting to transfer import licenses\n- [ ] Formally assign Kyle the role of \"General Manager\" or \"Operations Manager\"\n- [ ] Kyle and another individual to conduct an inventory check\n- [ ] Evaluate feasibility and plan for opening a central retail storefront\n- [ ] Schedule face-to-face meeting to sample new wines and discuss market programming\n\n---\n\n## AI Suggestions\n\n> - The final purchase price for goodwill and assets remains the main unresolved point for the LOI. The seller deemed the 70,000 US offer too low and is preparing a counter-offer.\n> - The discussion on the variable commission structure was incomplete as one participant forgot the relevant documents. The specific terms need to be finalized.\n> - While the sales target of 1,300 cases per month was set, its feasibility requires further validation, possibly through a detailed financial model review with Roberto.\n> - The proposal to open a retail storefront was acknowledged as necessary but lacks a concrete plan, owner, timeline, or budget for execution.\n> - The exact wording for the revised \"inventory shrinkage\" clause was not finalized; the team needs to decide whether to remove it or rewrite it with a specific percentage for marketing.\n"
  },
  {
    "date": "2026-01-05",
    "title": "Roberto & Sharon - Vino Veritas DD Update",
    "filename": "2026-01-05-roberto-sharon-dd-update.md",
    "content": "# Roberto & Sharon - Vino Veritas DD Update\n\n- **Date:** 2026-01-05\n- **Duration:** 52m 30s\n- **Participants:** Sharon, Roberto, Darryl, Kyle\n- **Source:** [Plaud.ai Recording](https://web.plaud.ai/s/pub_4aee1f46-45bc-4211-b415-6515598e4746)\n\n## Negotiation of Acquisition Terms for Vino Veritas by 7 Cellars\n\nThis summary outlines a negotiation between the principals of 7 Cellars (the buyers) and Vino Veritas (the sellers) regarding the acquisition. The discussion primarily addresses the sellers' dissatisfaction with the initial offer, leading to a revised proposal that better accounts for the business's tangible and intangible assets.\n\n---\n\n## Initial Offer Concerns and Points of Contention\n\n- Sharon (primary investor) found the initial terms unfavorable, particularly the inventory handling — consignment basis with reimbursement only at landed cost as items sold, with 50-50 profit split\n- Sharon criticized the **5% ownership stake** in 7 Cellars as \"vague\" — 7 Cellars is a new entity with no established value\n- Vino Veritas has a **15-year history** and significant goodwill in the Cayman market\n- Sharon dismissed the **$50,000 signing bonus** as insufficient — she could repay the debt herself\n- Sharon's total investment: **~$150,000 to purchase** the business + **$50,000 in upgrades**\n- The offer overlooked valuable physical assets: expensive metal shelving, custom wooden wine racks, and equipment\n- Roberto felt the deal wasn't right if Sharon (his wife and investor) wouldn't be fairly compensated\n\n---\n\n## Buyer's Rationale and Long-Term Strategic Vision\n\n- Valuation based on standard **EBITDA multiple** — with a market-rate GM salary factored in, EBITDA is essentially zero\n- The 5% equity positioned as significant long-term opportunity — vision extends beyond wine to **RTD products and premium vodka** under \"7 Cellars Wine and Spirits\"\n- Ultimate goal: grow brands to multi-million dollar valuation, potentially sell to a major player like **Dart**\n- Roberto's 5% could be worth **$1M from a hypothetical $20M brand sale**, plus 5% of all distributed profits\n- Three partners would dilute their own shares equally to bring Roberto in as a partner, not just an employee\n\n---\n\n## Identifying Unaccounted Business Value\n\n- Sharon argued successfully that initial offer missed significant tangible assets (shelving, wine racks, equipment)\n- Warehouse owner commented on shelving's value and provided contact for a formal appraisal\n- Kyle acknowledged the point from his construction experience and purchasing similar shelving from Mepco receivership\n- Beyond physical assets: **Vino Veritas brand** has 15-year market presence, credibility, and name recognition (\"goodwill\")\n- Additional investments: delivery van, websites, local marketing, warehouse improvements\n\n---\n\n## Convergence on a Revised Deal Structure\n\nThe revised structure:\n\n- **Upfront Payment:** Initial $50,000 US supplemented by additional amount for fair value of warehouse shelving and physical assets\n- **Inventory Liquidation:** Existing inventory sold on priority basis over a **fixed six-month period**\n- **Profit Sharing:** During the six months, profits from inventory sale split **50-50**\n- **Inventory Buyout:** At end of six months, 7 Cellars purchases any remaining unsold inventory at **full landed cost**\n\nDarryl estimated this revised deal would result in sellers receiving approximately **300,000 CI**. Sharon and Roberto agreed this was \"definitely more reasonable.\"\n\n---\n\n## Action Items\n\n**Sharon:**\n- [ ] Call the appraiser recommended by the property owner to get a valuation of the warehouse shelving and equipment\n- [ ] Coordinate with the appraiser to visit the warehouse and provide a valuation report to 7 Cellars\n\n**Kyle:**\n- [ ] Visit the warehouse to personally inspect the quantity and condition of the shelving to assist in determining fair value\n\n**Darryl:**\n- [ ] Amend the formal agreement to reflect the revised deal structure upon agreeing on the asset valuation\n"
  },
  {
    "date": "2025-12-19",
    "title": "Roberto - Vino Veritas - DD Financial Update",
    "filename": "2025-12-19-roberto-dd-financial-update.md",
    "content": "# Roberto - Vino Veritas - DD Financial Update\n\n- **Date:** 2025-12-19\n- **Duration:** 35m 41s\n- **Participants:** Darryl, Roberto, Kyle\n- **Source:** [Plaud.ai Recording](https://web.plaud.ai/s/pub_289f1668-d06c-4e7e-bdf0-a1df0cf7e361)\n\n## M&A Discussion: Structuring the Acquisition and Future of Vino Veritas\n\nThis conversation details the proposed acquisition of Vino Veritas by Seven Cellars. The discussion covers operational and financial due diligence, analyzes the current business model and its scalability constraints, presents a comprehensive partnership offer to the owner, and outlines a strategic vision for post-acquisition growth, including key staffing and market penetration plans.\n\n---\n\n## Operational Due Diligence and Lease Logistics\n\nThe discussion clarified the current lease and licensing structure for the warehouse. Sharon (Roberto's wife) is the signatory on the lease and holds the associated license because she was the Caymanian partner at the time of establishment. Roberto has since become naturalized. Roberto believes Sharon would be willing to exit the lease agreement. The current lease allows for a sublet of up to 90% but not a full transfer.\n\nThe preferred path forward is for Seven Cellars to sign a new lease directly with the landlord, **Cindy O'Hara**, under the same terms. Roberto is confident this can be arranged due to his good relationship with Ms. O'Hara, an architect who also owns the Hyundai Prestige Motors business at the location.\n\n---\n\n## Financial Position and Asset Verification\n\n- Revenue figures represent **top-line gross sales**\n- Business operates with a \"monoproduct\" inventory, limited by Roberto's personal capital\n- All current inventory is **fully paid for and owned outright** — no consignment or lines of credit\n- Sole liability: **$50,000 USD personal loan** from Roberto's brother, repaid at $12,500 every six months\n- Seven Cellars intends to settle this liability in full as part of the acquisition\n- Incoming shipment from France has been paid for (only duty/fees outstanding on arrival)\n- Roberto generated approximately **$200,000 in revenue** from an initial product investment of around **$25,000**\n\n---\n\n## Business Model Analysis and Scalability Assessment\n\n- Revenue split: **60% private clients / 40% restaurants**\n- Wholesale margins for restaurants: **30% to over 100%** (2.1x markup), plus additional 30% for retail\n- On exclusive high-demand wines: a bottle purchased for $100 could sell to a restaurant for $300, listed at $900-$1,200\n- Primary constraint: **volume problem** caused by insufficient cash flow for inventory\n- Competitors are \"sleeping\" and \"relaxed\" — significant opportunity\n- Both parties agreed business has potential to **scale 10x or more** with capital\n\n---\n\n## Proposed Partnership and Offer Structure\n\nDarryl outlined a directional offer structured as a partnership:\n\n- **General Manager Role:** Roberto would run day-to-day operations\n- **Signing Bonus:** Upfront payment to recognize the value Roberto has built\n- **Debt Clearance:** Seven Cellars would immediately pay off the $50,000 loan\n- **Full Funding:** Seven Cellars takes over all licensing, infrastructure, and inventory funding\n- **Salary and Equity:** Competitive salary as GM and a small equity stake in Seven Cellars\n\nRoberto expressed strong interest in this partnership structure.\n\n---\n\n## Post-Acquisition Growth Strategy and Staffing Plan\n\n- Transform into a **multi-million-dollar operation**\n- Target **ultra-high-net-worth market** — service private clients directly in their homes\n- Immediate target: **50 high-net-worth residents at the Watermark development**\n- Roberto suggested reviving the exclusive **\"La Chaîne des Rôtisseurs\"** culinary society\n\n### Initial Staffing Plan:\n- **Roberto** as General Manager\n- **One or two professional, client-facing sommeliers** for sales, tastings, and relationship management\n- **One warehouse and logistics person** for deliveries and inventory management\n- Back-office functions (e-commerce, marketing, tech) handled at cost by partners' existing staff\n\n---\n\n## Action Items\n\n**Roberto:**\n- [ ] Have informal conversation with landlord (Cindy O'Hara) about willingness to sign new lease with Seven Cellars\n\n**Darryl:**\n- [ ] Discuss proposed deal structure (signing bonus, salary, equity, GM role) with partners Kyle and Duane\n- [ ] Formulate and present a formal offer to Roberto — before Christmas (tentative)\n"
  },
  {
    "date": "2025-12-11",
    "title": "Roberto - Vino Veritas - DD Check In",
    "filename": "2025-12-11-roberto-dd-check-in.md",
    "content": "# Roberto - Vino Veritas - DD Check In\n\n- **Date:** 2025-12-11\n- **Duration:** 11m 10s\n- **Participants:** Roberto (Speaker 1), Darryl\n- **Source:** [Plaud.ai Recording](https://web.plaud.ai/s/pub_52c46095-d7db-4b39-8d43-507263ea6d5d)\n\n## Keywords\n\n`Due Diligence` · `Market Competition` · `Wine Distribution`\n\n---\n\n## Meeting Notes\n\n### Due Diligence and Administrative Status\n\n- Roberto has been busy and has not yet completed the diligence requests regarding financial numbers.\n- Roberto plans to work on the requests on Sunday.\n- The NDA (Non-Disclosure Agreement) has not been signed yet. Roberto agreed to sign and return the standard NDA immediately.\n\n### Current Business Performance (Vino Veritas)\n\n- Roberto recently hosted a successful wine tasting event, generating approximately **$3,600 in sales**.\n- Holiday gift basket requests are significantly lower than last year, as clients seem to want different options this year.\n- Roberto is currently operating the business alone.\n\n### Competitor Analysis: Tortuga and Canadian Wine\n\n- Darryl reported that **Tortuga** is aggressively pursuing exclusive rights for Canadian wine and ordered two pallets valued at **$35,000 each**.\n- Tortuga claims these imports are destined for private clients at Ritz-Carlton residences.\n- Roberto noted that Tortuga historically focused on rum and cakes but is now pushing into the wine market with new staff.\n- There are conflicting views on Canadian wine demand: Competitors (like Mario) previously took four years to sell high-end Canadian wine (Checkmate), while Tortuga is ordering heavily.\n- Roberto believes Canadian wine quality has improved and there is a demographic of wealthy Canadians on the island willing to purchase it.\n\n### Market Strategy and Sales Pipeline\n\n- Roberto is targeting the **Prosecco market** and trying to introduce \"Private Cuvee\" to local hotels.\n- **Westin:** Roberto expects an answer regarding a deal next week.\n- **One GT:** Discussions deferred to January as they open in February.\n- **The Norman:** Contact is currently too busy for immediate sales discussions.\n- Roberto observed that competitors like CDG have stale portfolios and are selling stock at cost to generate cash flow, creating an opportunity for new market entries.\n\n---\n\n## Next Arrangements\n\n- [ ] Roberto to sign and return the NDA later today.\n- [ ] Roberto to compile and send diligence numbers/requests (likely by Sunday).\n- [ ] Roberto to follow up with Westin regarding the wine proposal next week.\n\n---\n\n## AI Suggestions\n\n> - There is conflicting intelligence regarding the viability of high-end Canadian wine imports (Tortuga is buying heavily vs. historical data showing slow sales); this market segment needs validation.\n> - Shipping logistics for Canadian wine were noted as complex and expensive (West Coast sea route); the impact on profit margins remains unclear.\n> - Competitors (e.g., Mario/Watermarks) may be using restaurant licenses to import for private clients, which Roberto suggests might be a regulatory grey area worth investigating.\n"
  },
  {
    "date": "2025-12-08",
    "title": "Roberto Vino Veritas - Deal Pitch - 7 Cellars",
    "filename": "2025-12-08-roberto-deal-pitch.md",
    "content": "# Roberto Vino Veritas - Deal Pitch - 7 Cellars\n\n**Date:** 2025-12-08  \n**Location:** [Not specified - likely remote/call]  \n**Duration:** 23m 24s  \n**Participants:** Roberto (Vino Veritas), Darryl, Seven Cellars team  \n**Source:** [Plaud Recording](https://web.plaud.ai/s/pub_990749e1-7d91-4f3c-8310-c8ab337efa11::-ucjLHNlOfMGnVcHx-hI5b5ue2ckThCQiwfSbypgAX48XCqJW8SDb06tq2kREjgLE0EACzbSZ2y5e-sC)\n\n---\n\n## Seven Cellars' Entry into the Cayman Wine Market\n\n- Official decision to enter under brand \"7 Cellars\" (7cellars.ky)\n- Company emails set up, brand assets established\n- Strategic intent: gold-standard provider with white-glove service, superior customer experience, robust technology backbone\n- Target: market disruption of existing players (Jacques Scott, CDG); become largest wine distributor on the island\n\n## Partnership Intent with Roberto\n\n- Strong interest in collaboration; Roberto impressed with transparency and approach\n- Seven Cellars proposes **acquiring Roberto's business** and integrating into Seven Cellars\n- Emphasis on honesty, trust, transparency; NDAs to protect shared information\n\n## Proposed Deal Structure\n\n### Transaction Type\n- **Asset purchase** (preferred over share purchase — cleaner)\n\n### Components to Acquire/Integrate\n- Lease on Roberto's warehouse/office space\n- Roberto's expertise, relationships, and brand (Vino Veritas)\n- Inventory handled separately via consignment\n\n### Inventory Treatment\n- Put on consignment; commitment to sell all within ~6 months\n- 100% of inventory cost proceeds to Roberto to recoup working capital\n\n### Valuation Methodology\n- Based on profit after paying reasonable market salaries to replace owner-operator functions\n- Apply industry-standard multiples to normalized profit\n- **Key data required:** top-line revenue, profit after salaries, owner compensation, adjusted profit if replacing Roberto with salaried GM\n\n### Compensation Elements\n- **Signing bonus** (based on business value)\n- **Salary** for Roberto (income certainty)\n- **Equity ownership stake** in Seven Cellars\n\n## Operational Support from Seven Cellars\n\n- Cover operational expenses: licenses, inventory funding, rent, backend costs\n- Technology-driven inventory control, finance, accounting\n- Website and digital infrastructure (led by Duane)\n- Kyle to leverage operations expertise and staffing network\n- Targeted improvements: capital availability, systems/processes, scaling beyond one-person operations\n\n## Facility Lease Details\n\n- 3-year lease signed in September (recent)\n- ~50% below typical market cost for similar units\n- **Strategic priority:** retain the space\n- Assess transferability to Seven Cellars; if not, keep under Vino Veritas while integrating ops\n\n## Market Timing and Launch Plan\n\n- **Target event:** Cayman Cookout as high-profile launch\n  - Announce acquisition of Vino Veritas\n  - Tasting events and special activations\n  - Corsetti wines dinner, morning wellness classes, several activations\n- **Timeline:** Aim to complete deal over Christmas holidays for Cookout launch\n- Maintain relationship-first approach and respect for pace\n\n## Data and Documentation Requirements\n\n### From Roberto:\n- Revenue figures (current and historical)\n- Profit after paying market-rate salary for ops/management\n- Owner compensation details\n- Inventory levels and cost basis\n- Personal debt/credit lines tied to inventory financing\n\n### From Seven Cellars:\n- MNDA draft for review and signature\n- Vision and positioning document\n- Email outlining specific data points for valuation\n\n## Next Arrangements\n\n- [ ] Seven Cellars to email Roberto the MNDA\n- [ ] Roberto to review, sign, and return MNDA\n- [ ] Seven Cellars to send vision/positioning document\n- [ ] Seven Cellars to provide detailed list of required financial data\n- [ ] Roberto to compile and share business financials and inventory details\n- [ ] Review lease agreement for transferability\n- [ ] Schedule follow-up call (target later this week) to review numbers and deal terms\n- [ ] Seven Cellars to draft preliminary offer based on provided data\n- [ ] Plan Cayman Cookout launch activities\n- [ ] Aim to finalize acquisition over Christmas holidays\n"
  },
  {
    "date": "2025-12-07",
    "title": "M&A Strategy with Joel Sherlock - 7 Cellars",
    "filename": "2025-12-07-ma-strategy-joel-sherlock.md",
    "content": "# M&A Strategy with Joel Sherlock - 7 Cellars\n\n**Date:** 2025-12-07  \n**Location:** [Not specified]  \n**Duration:** 34m 31s  \n**Participants:** Joel Sherlock, Consultants  \n**Source:** [Plaud Recording](https://web.plaud.ai/s/pub_c61cfbdc-9f6f-47b3-8cf4-8d377f461198::Gfdg-SkqJ-NMSigRFTzDzppq1NlToGKqDgsSdcS2B_VV1IiG-LcdsFi9h69-ZYOigdR4HnGWSef4m9QC)\n\n---\n\n## Acquisition and Partnership Strategy for Cayman Wine Business\n\n### Target Operator Profile\n- **\"Rob/Roberto\":** mid-60s, hospitality background (former F&B director, tableside flambés), customer-service oriented; dislikes back-office; passion project mindset\n- Wife runs successful commercial cleaning business (160 employees), providing household security\n\n### Role Design and Operating Model\n- Rob positioned as GM and white-glove customer service lead\n- Back office, inventory, financing, billing, website, logistics fully centralized by buyer group\n- Keep Rob in \"zone of genius\" — service and relationships\n\n### Salary and Compensation\n- **Base salary recommendation:** $100,000\n- **Equity:** initial 10% at closing + additional 10% vested on performance (sales growth, profitability, KPIs)\n- Equity valuation context: current business ~$300k → 10% = ~$30k; long-term target $10–$20M enterprise value\n\n### Debt and Risk Removal\n- Identify personal debts funding inventory (e.g., $80k LOC, $60k credit card)\n- Structure repayment from inventory liquidation within first 6 months\n\n### Purchase Price Structure\n- Shareholder loan/earn-out: pay from free cash flow (e.g., $100k/year for 3 years = $300k)\n- Rationale: business likely wouldn't fetch $300k if listed today; earn-out preserves capital for website, inventory, salary\n\n### Strategic Rationale\n- \"Fast-forward\" 2–3 years of execution and learning curve\n- Execution risk: wrong GM or reputation damage could force rebrand/restart\n\n### Negotiation Posture\n- Transparent and firm: buyer group entering Cayman wine regardless; well funded; licenses secured\n- Friendly but clear \"join us or compete\" framing\n- Get Rob's valuation number early to anchor expectations\n\n### Growth Targets\n| Scenario | Year 1 | Year 2 | Year 3 |\n|----------|--------|--------|--------|\n| Without Rob | ~$150k | ~$400k | ~$1M |\n| With Rob | ~$1M | — | — |\n\nNet positive even paying $300k if relationships accelerate time-to-profit.\n\n---\n\n## Case Study: ClearSolve Deal Mechanics\n\n- Counterparty \"Dan\" had ethanol licenses and beverage company\n- Buyer purchased 50% by matching invested capital + shared LOC secured by all shares\n- Minimal draw (~$50k); within a year, sales supported new LOC; buyer recovered cash + $3M dividend in ~18 months\n- **Lessons:** Match capital, secure LOC, leverage early traction to refinance; pay from business cash flow\n\n---\n\n## Go-To-Market and Brand Expansion\n\n### Olive Oil Brand\n- High-end Italian olive oil with strong production but weak branding\n- Plan: buy bulk, redesign packaging, manage brand; aligns with wine portfolio\n\n### Tuscany Property\n- Considering vineyard acquisition with olive oil and wine production\n- White-label amendments with DOCG producers to accelerate market entry\n- Distribution: Puerto Rico (restaurant network), Cayman (Seven Cellars), US (Texas), plus additional\n\n### Product Strategy\n- Focus on approachable Italian reds (Super Tuscans) for non-collectors\n- Obscure Italian reds: 80% of quality at 20% of price vs top-tier\n- Burgundy positioning for connoisseurs\n\n---\n\n## Cayman Market Data\n\n- Top restaurants: ~250–350 cases/month across all SKUs\n- Baseline: 2 cases/month per account = 24 cases/year per SKU\n- Seven Cellars status: operational (bank accounts, apparel, cards, emails, licenses, 7cellars.ky)\n\n---\n\n## Risk Management\n\n| Risk | Mitigation |\n|------|------------|\n| Misfit GM / brand damage | Performance vesting, back-office controls |\n| Overvaluation / blue-sky projections | Early anchor from Rob, structured earn-out |\n| License timing | Already secured |\n\n---\n\n## Action Items\n\n- [ ] Confirm Rob's desired base salary; finalize $100k offer\n- [ ] Define GM role scope; document back-office split\n- [ ] Request full financials: revenue, margins, inventory, liabilities, cash flow\n- [ ] Quantify Rob's personal debt on inventory; draft assumption/retirement plan (6 months)\n- [ ] Obtain Rob's valuation number; set early anchor\n- [ ] Structure equity: 10% at closing + 10% performance vesting with KPIs\n- [ ] Draft purchase terms: shareholder loan/earn-out from free cash flow\n- [ ] Build 3-year revenue scenarios (with/without Rob) to validate ROI\n- [ ] Communicate market entry intent with preference to partner\n- [ ] Rebuild website/digital presence for Seven Cellars\n- [ ] Develop SKU strategy: Burgundy, Italian reds, Super Tuscans; map target accounts\n- [ ] Establish working LOC with Kyle; set interest terms (~10%)\n- [ ] Begin olive oil brand development\n- [ ] Coordinate Tuscany sourcing trips; appoint Italian tasting/rep role\n- [ ] Map distribution beyond Cayman: Puerto Rico, Texas, US relationships\n- [ ] Prepare negotiation script: transparency, partnership preference, market entry inevitability\n- [ ] Schedule in-person meeting (Rob's suggested New Year's B.C. trip)\n"
  },
  {
    "date": "2025-12-06",
    "title": "Roberto Vino Veritas - 7 Cellars (1st Visit)",
    "filename": "2025-12-06-roberto-vino-veritas-1st-visit.md",
    "content": "# Roberto Vino Veritas - 7 Cellars (1st Visit)\n\n**Date:** 2025-12-06  \n**Location:** Cayman Islands  \n**Duration:** 1h 48m 48s  \n**Participants:** Roberto (Vino Veritas), Consultants  \n**Source:** [Plaud Recording](https://web.plaud.ai/s/pub_3310c670-d7ba-41f1-8ac4-c80f083ca749::5J3jVOJZ_5H-QG0be8eV40HptQfPUdtOd_EauESidWN8f7_CWlbE-HmZqO-QaetbPmb9m1SKk_wMKSAC)\n\n---\n\n## Executive Summary\n\nThe Cayman Islands wine market presents a clear opportunity for a service-led, quality-focused distributor to capture share from incumbent players through superior customer experience, curated portfolios, and selective exclusivity. While licensing and capital intensity pose constraints, the combination of Roberto's procurement relationships and local rapport with an operationally strong, well-capitalized partner can scale a differentiated model targeting high-end restaurants, ultra-high-net-worth (UHNW) clients, and boutique retail.\n\n## Market Structure and Licensing\n\n- Cayman restaurant licenses include import rights, enabling direct wine imports; however, many venues reverted to distributors due to high warehouse costs, slow inventory turnover, and cash flow constraints\n- Government considering raising wine/spirits license fees from ~CI$4.5–4.8k to ~CI$25k, pressuring smaller operators\n\n## Current Market Conditions and Demand\n\n- Unusually weak wine sales in Sept–Oct; more restaurants closed entire September and early October\n- August \"so-so\"; November weaker than last year\n- Tourism demand closely tied to US visitor trends\n- Cayman continues to attract new wealth (including crypto); higher-end concepts expanding, some hiring sommeliers\n\n## Competitive Landscape and Pricing\n\n- Large distributors (CDG, Jacques Scott) rely on aggressive discounting to manage inventory (e.g., Prosecco retail at CI$12.99)\n- Jacques Scott requires accounts to purchase ~75% of products to access certain wine-by-the-glass offerings\n- Widely reported service deficiencies create gap for \"white glove,\" rapid-response model\n- Notable talent: Adam at Jacques Scott (high service, potential recruitment target)\n\n### Market Context and Inventory Dynamics\n- CDG's clearance pricing reflects high overhead and need to make room after slow Aug–Nov\n- DART oversight and margin pressures may lead to conservative ordering next year, opening windows for agile competitors\n\n## Regulatory and Compliance\n\n- Government exploring PR fee increases and potential cancellations for problematic non-citizens\n- Team advantages: strong local ties (Kyle married a Caymanian), commitment to ethical operations\n\n## Roberto's Business Model and Positioning\n\n- Current operation intentionally lean and hobby-like due to capacity/capital limits; emphasizes quality and selective exclusivity\n- Protects venue differentiation (e.g., supply Luca but avoid selling same SKUs next door; allow limited radius expansion)\n- Demonstrated high-touch service: rapid fulfillment (e.g., 10 cases of Prosecco delivered next morning for Grand Old House)\n- Strategy: seed key openings (e.g., 1GT in Feb; Grand in July) with limited, strong SKUs; scale breadth later\n\n## Product Strategy and Unit Economics (Prosecco Example)\n\n| Metric | Value |\n|--------|-------|\n| Net purchase price | ~€2.50/bottle after discounts |\n| Logistics | ~CI$1.30/bottle |\n| Duty | ~CI$5.80/bottle |\n| Landed cost | ~CI$9/bottle |\n| Entry wholesale | CI$13/bottle (~CI$4 margin) |\n| Post-adoption wholesale | CI$18–19 |\n| Post-adoption retail | CI$26–28 (Private Cuvée) |\n\n## Watermark Opportunity (UHNW Focus)\n\n- Weekly tastings/pairings; individual wine lockers for 50 units; many billionaire owners with large cellars\n- Service expectation: white-glove experience; zero-markup bar pricing for owners; demand for niche SKUs (e.g., Taittinger non-alcoholic sparkling)\n- Implementation: secure SKUs via direct rep relationships (Bichot/Taittinger), inventory tech (automated rack scanning), monthly invoicing, sommelier-driven replenishment\n- Roberto cannot deliver alone at this scale; partnership committed not to bypass him\n\n## Capacity, Constraints, and Infrastructure\n\n- Current capacity: two containers/year due to capital limits; significant inventory held\n- Website/digital presence is critical weakness; requires overhaul\n- Available assets: existing corporate entity and licenses; 5,000 sq ft climate-controlled storage (Kyle's facility)\n- Logistics: pallets from Europe ~28–30 days via Tropical; small-case DHL ~5–10 days (higher cost)\n\n## Pricing, Margins, and Volumes\n\n- Champagne margin ~30% to keep quality accessible\n- Wholesale multipliers: 1.875x–2.10x; retail add ~30%; rare vintages 3–4x\n- At least two 40-foot containers per shipment capacity\n- Consider lowered markups (e.g., 1.60x) to expand placements, contingent on supply and working capital\n\n## Investment and Partnership Options\n\n### Partnership Pathways:\n1. **Acquisition:** Integrated Vino acquires Vino Veritas\n2. **Investor-partnership:** Integrated Vino invests for equity; Roberto retains stake\n- Roberto favors \"Coppola\" model with retained ownership and pride\n\n### Wine Fund Concept:\n- Minimum investment ~US$500k, 5-year horizon, select appreciating vintages\n- Storage in secure European vaults; partner with trading firms\n\n## Retail and Experience Concepts\n\n- Boutique retail in Walker's Road/Red Bay corridors with premium accessories (e.g., Riedel)\n- **\"Cantina\" concept:** crystal carafe tastings, rotating food items, family-oriented (inspired by Chateau Elan)\n- **Vino tourism:** winery experiences (barrel tastings, winemaker sessions, cooking classes) via European connections\n\n## Facilities, Costs, and Logistics\n\n- Current facility ~2,000 sq ft; rent ~CI$4,935/month; utilities ~CI$1,800/month (24/7 AC at 64°F)\n- Kyle's buildings provide scalable storage at fair market terms\n- Tropical shipping: Wednesday/Sunday arrivals; Thursday clearance\n\n## Risks and Sensitivities\n\n- License fee hikes could compress margins\n- Competitive discounting requires smart SKU management\n- Working capital and inventory turnover critical for sustained low markups\n\n---\n\n## Action Plan\n\n### Licensing and Compliance\n- Validate timing/impact of license fee changes; update pro forma economics\n- Map PR/status regulatory shifts; document compliance plan\n\n### Market and Pricing\n- Audit competitor pricing/SKUs across top venues\n- Implement pricing transition: wholesale CI$13 → CI$18–19; retail CI$26–28\n- Define restaurant markup policy (e.g., 1.60x) contingent on supply cadence\n\n### Portfolio and Sourcing\n- Secure Taittinger non-alcoholic sparkling via Bichot/Taittinger rep\n- Develop initial portfolio of small, high-quality domaines (10–20 case allocations)\n- Request Roberto's shortlist of rare vintages and niche champagnes\n\n### Operations and Infrastructure\n- Full inventory count and independent valuation; quantify capital needs\n- Assess storage capacity (Kyle's facility vs current)\n- Replace website vendor; launch 90-day digital overhaul\n- Hire logistics support; implement inventory/CRM/accounting systems\n\n### Key Accounts and Pilots\n- Pilot white-glove service with Grand Old House, Luca; define emergency delivery SLAs\n- Finalize Prosecco placements for 1GT (Feb) and Grand (July)\n- Engage Watermark (Sean) with curated list, tech demo, sommelier recommendations\n\n### Talent\n- Explore recruitment of Adam; establish sommelier pipeline via European schools\n- Consider consulting with Erin and a Master Sommelier\n\n### Partnership Structure\n- Prepare financial models for acquisition vs investor-partnership\n- Structure roles, capital, inventory strategy, exclusivity policy\n\n### Retail and Experiences\n- Design/pilot \"cantina\" concept; secure retail locations\n- Plan wine tourism programs (3–4 trips/year)\n"
  },
  {
    "date": "2025-12-04",
    "title": "Chad @ Craft Food & Beverage Co. - 7 Cellars",
    "filename": "2025-12-04-chad-craft-fb.md",
    "content": "# Chad @ Craft Food & Beverage Co. - 7 Cellars\n\n**Date:** 2025-12-04\n**Attendees:** Darryl Hicks, Chad (Craft F&B Owner), Erin (Sommelier), Kyle\n**Location:** Cayman Islands\n**Duration:** 55m 26s\n**Source:** Plaud\n\n## Summary\nThis consultation focused on establishing a boutique wine distribution business in the Cayman Islands to address gaps left by existing large distributors. Chad represents a significant restaurant group managing approximately **10 restaurants**. The discussion highlights dissatisfaction with the current market monopoly, specifically the lack of wine variety, poor customer service, and restrictive purchasing requirements. The desired outcome is a white-glove partnership where 7 Cellars provides exclusive wine portfolios, reliable delivery, and staff training (sommelier support) to differentiate client venues from competitors.\n\n## Background\nThe meeting takes place between the 7 Cellars team (representing a new distribution venture with partners Kyle and Dwayne) and a stakeholder in a large local restaurant group. Key context includes limitations of current dominant distributors (Jacques Scott, Tortuga), the high-end needs of the Watermark project (50 units with wine lockers), and the plan to secure **5,000 square feet** of warehousing (starting at **2,500**).\n\n## Pain Points\n\n### 1. Lack of Product Differentiation and Market Saturation\n**Problem:** Wine lists across the island are nearly identical due to limited distributor options, making it difficult to offer a unique dining experience.\n**Impact:** Restaurants cannot differentiate; customers see the same brands everywhere, reducing perceived value.\n**Quote:** \"Every single one of these places along the beach has Rombauer and Duckhorn and that's it.\"\n\n### 2. Poor Distributor Service and Forced Bundling\n**Problem:** Existing distributors leverage their monopoly to force unfavorable terms and refuse to source specific products.\n**Impact:** Cannot get desired wines without accepting unwanted inventory.\n**Quote:** \"If you take that, you have to take two pieces of my shitty rosé at the same time.\"\n\n### 3. Staff Knowledge and Training Gaps\n**Problem:** Lack of qualified sommeliers and general wine knowledge among floor staff, hindering effective selling of premium wines.\n**Impact:** Without proper training, customers may not understand why a $105 bottle is better than a recognizable brand.\n**Solution Proposed:** \"Fractional sommelier\" model to address this.\n\n## Expectations\n\n### 1. White-Glove Service and Reliability\n- High-touch service model focused on saying \"yes\" to requests\n- Weekly deliveries\n- Responsive customer service representatives\n- Timeline: Watermark about a year away; distribution business starting \"pretty soon\"\n\n### 2. Exclusive and Curated Product Portfolio\n- Wine list unique and not available at local liquor stores\n- Including back vintages (10, 15, 20 years old)\n- Leveraging connections to wineries in Burgundy and Canada\n- Strong margins on exclusive bottles ($30-$50 cost basis)\n\n### 3. Support for Watermark Private Owners\n- High-end consultation and stocking services for 50 units with private wine lockers\n- Wine-themed events and tastings\n- Cellar build consultations\n\n## Key Points\n- Chad's group manages approximately 10 restaurants on island\n- Current pricing: 10% discount off retail for licensees\n- Target margins on bottles: $30-$50 depending on cost\n- Chad validates market opportunity: \"Way more so now than 10 years ago\"\n- Canadian migration creating new high-net-worth clientele\n- Adam from Jacques Scott is current rep - excellent customer service\n- Interest in \"fractional sommelier\" model for staff training\n- Future vodka brand (Caymanian premium vodka) planned for 3 years out\n\n## Action Items\n- [ ] 7 Cellars to find/refer a candidate for Sommelier/Executive Chef position for Chad\n- [ ] Note hiring practices/resources for hospitality recruitment\n- [ ] Stay in touch regarding distribution business launch timeline\n- [ ] Connect with Dale's contact regarding three restaurants\n- [ ] Consider \"Curated Exclusive Collections\" with contractual exclusivity\n\n## AI Suggestions\n1. **Curated \"Exclusive\" Collections:** Create tiered portfolio where specific rare vintages are contractually exclusive to restaurant group\n2. **Fractional Sommelier Program:** Bundle distribution with monthly training package\n3. **Menu Engineering Consultation:** Design wine pairings using unique SKUs to demonstrate margin improvements\n4. **VIP Tasting Events:** Host exclusive tastings for Watermark owners\n\n## Other Information\n- **Future Vodka Brand:** Plan to launch high-end Caymanian vodka in ~3 years\n- **Consultant Background:** Tech business using AI for fraud analysis on Visa/Mastercard rails\n- **Market Context:** \"Canadian mafia\" in Cayman; political/tax situations driving wealthy Canadians to move to island\n- **Trade Issues:** Tariff war caused $14 million worth of US inventory pulled from shelves in Nova Scotia\n\n## Full Transcript\n\n**00:00:00 - Chad:** He spoke to my partner, but I wasn't present at that point whenever I was in that, so you can maybe give me a rundown of what you're doing.\n\n**00:00:00 - Darryl:** Yeah, so we're looking to, well, we've already started down the road with more of a boutique distribution. We want to fill gaps where more nimble, the smaller, the... We've got up to 5,000 square feet at the moment. We're starting off at 25, but we can just not renew at least.\n\n**00:02:16 - Darryl:** I kept coming down and just noticed that there was, it was tough to get some of the wines that I really enjoy back up in Canada. It just seems like there's a lot of gaps here and when we were talking to Kyle, we're all like serial entrepreneurs, and Kyle exited out of Ironshore, and he's got a bunch of rental units here, and I feel like he's just kind of getting a little bit bored.\n\n**00:03:03 - Darryl:** So we're all hanging out together this summer, and I've wanted to have a business down here for obvious reasons as a Canadian for a while. I'm super passionate about wine, have a ton of contacts, close personal friends who are like owners of wineries in Burgundy, and some of the best wineries in Canada.\n\n**00:03:34 - Darryl:** There'd probably be an opportunity to do something white glove differentiated. Aaron's like a killer sommelier and so we said what if we came down instead of working with some of the restaurants to say we could actually help you build a really really great wine list.\n\n**00:06:04 - Darryl:** What's your take on that? Do you think that there's a gap there in the market for us to fill?\n\n**00:06:04 - Chad:** Way more so now than there was 10 years ago. Really? Absolutely.\n\n**00:12:02 - Darryl:** We have a vision for like, say, three years from now, where we actually want to have our own brand, like a Caymanian super high end luxury vodka, maybe some RTDs to go along with it. But the way to start now is by doing the wine business, the wine import.\n\n**00:12:33 - Darryl:** We've heard stories from other people that said, well, I asked for this particular SKU from Jacques Scott, and they're like, I'm not going to import that for you. Or he's like, well, that's a really exclusive SKU. If you take that, you have to take two pieces of my shitty rosé at the same time.\n\n**00:19:00 - Darryl:** Every single one of these places along the beach has Rombauer and Duckhorn and that's it and it's like I'm like really, again.\n\n**00:26:20 - Darryl:** So that's great validation. Appreciate that. I think what we're hoping to do is partner with the Psalms and say, hey, what do you want? We can source back vintages. Stuff like 10 years old, 15 years old on a lot of the wine lists around here.\n\n**00:28:03 - Darryl:** And do what you say you're going to do, and do it on time, right? Yeah, actually deliver. So that's what we plan to do. We want to be like that niche player here who builds a reputation on being like, we're the guys who deliver.\n\n**00:43:15 - Darryl:** Do you think there'd be a market for that? Like if you had something, okay, maybe not in the restaurants, but like Kyle is absolutely convinced that there is a hole in the market for like something that Caymanians can be really proud of that's from here. And he thinks it should be a really good premium vodka.\n\n**00:51:38 - Chad:** Cool. Well, man, I really appreciate the help. Yeah, stay in touch and let me know when you're getting things rolling. If you have questions, reach out to me.\n\n**00:52:11 - Darryl:** We've got the relationships, we've got the licenses, we've got the warehouse space. We're going to get started here pretty soon, so we'd love to keep in touch with you.\n\n**00:53:26 - Erin:** Having someone who is focused on the wine, that's why you can't do everything. So they focus on putting that together, and they do the staff training, the staff education.\n\n**00:53:48 - Darryl:** In tech, we have this expression, time to first value. This will be my time to first value for you. I'm going to find you a sommelier.\n"
  },
  {
    "date": "2025-12-04",
    "title": "Chad @ Craft Food & Beverage Co. - 7 Cellars",
    "filename": "2025-12-04-chad-craft-food-beverage.md",
    "content": "# Chad @ Craft Food & Beverage Co. - 7 Cellars\n\n**Date:** 2025-12-04  \n**Location:** Cayman Islands  \n**Duration:** 55m 26s  \n**Participants:** Consultant (Roberto), Chad (Restaurant Group Owner)  \n**Source:** [Plaud Recording](https://web.plaud.ai/s/pub_e020cfc8-9d1b-4dd0-862c-172acb9ea226::zgfNJPc-gh_JWWu7Xie4gqY82t2FxgmZIgc_1i3uYAlkx1c0n9NTBpfQa6xW3ZmAuP-gLoSx4UprRIEC)\n\n---\n\n## Overview\n\nThe consultation focuses on establishing a boutique wine distribution business in the Cayman Islands to address gaps left by existing large distributors. The customer represents a significant restaurant group, managing approximately 10 restaurants. The discussion highlights dissatisfaction with the current market monopoly, specifically the lack of wine variety, poor customer service, and restrictive purchasing requirements. The desired outcome is a white-glove partnership where the consultant provides exclusive wine portfolios, reliable delivery, and staff training (sommelier support) to differentiate the customer's venues from competitors.\n\n## Background\n\nThe meeting takes place in the Cayman Islands between a consultant (representing a new distribution venture with partners Kyle and Dwayne) and a stakeholder in a large local restaurant group. The consultant leverages a Canadian background and wine industry connections to pitch a new service model. Key context includes limitations of current dominant distributors (Jacques Scott, Tortuga), the high-end needs of the Watermark project (50 units with wine lockers), and the consultant's plan to secure 5,000 square feet of warehousing (starting at 2,500). The discussion also touches on the consultant's tech background and future plans for a local vodka brand.\n\n## Pain Points\n\n### 1. Lack of Product Differentiation and Market Saturation\n- **Problem:** Wine lists across the island are nearly identical due to limited distributor options\n- **Impact:** Restaurants cannot differentiate; customers see the same brands everywhere, reducing perceived value\n- **Current Situation:** Most restaurants carry the same standard brands (e.g., Rombauer, Duckhorn, Santa Margarita)\n- **Quote:** \"Every single one of these places along the beach has Rombauer and Duckhorn and that's it.\"\n\n### 2. Poor Distributor Service and Forced Bundling\n- **Problem:** Existing distributors leverage their monopoly to force unfavorable terms and refuse to source specific products\n- **Impact:** Cannot get desired wines without accepting unwanted inventory\n- **Quote:** A distributor said: \"If you take that, you have to take two pieces of my shitty rosé at the same time.\"\n\n### 3. Staff Knowledge and Training Gaps\n- **Problem:** Lack of qualified sommeliers and general wine knowledge among floor staff\n- **Impact:** Without proper storytelling and knowledge, customers may not understand why a $105 bottle is better than a recognizable brand\n- **Proposed Solution:** \"Fractional sommelier\" model\n\n## Expectations\n\n### White-Glove Service and Reliability\n- High-touch service model that focuses on saying \"yes\" to requests and delivering consistently\n- Weekly deliveries, responsive customer service\n- Watermark project about a year away; distribution business starting \"pretty soon\"\n\n### Exclusive and Curated Product Portfolio\n- Wine list unique and not available at local liquor stores, including back vintages (10, 15, 20 years old)\n- Leveraging consultant's personal connections to wineries in Burgundy and Canada\n- Strong margins on exclusive bottles (e.g., selling bottles with $30–$50 cost)\n\n### Support for Watermark Private Owners\n- High-end consultation and stocking services for 50 units with private wine lockers\n- Consulting on cellar builds, wine-themed events/tastings\n\n## Other Information\n\n- **Future Vodka Brand:** Plans to launch a high-end, premium Caymanian vodka in ~3 years\n- **Consultant Background:** Runs a tech business using AI to study transactions on Visa/Mastercard rails for fraud analysis\n- **Market Context:** \"Canadian mafia\" in Cayman — political/tax situations in Canada driving wealthy individuals to the island\n- **Staffing Help:** Consultant offered to use network to help find Executive Chef or Sommelier from Canada\n- **Trade Issues:** Tariff war between Canada and US causing $14M of inventory pulled from shelves in Nova Scotia\n\n## To-Do List\n\n- [ ] Consultant to find/refer a candidate for the Sommelier/Executive Chef position\n- [ ] Consultant to note hiring practices/resources\n- [ ] Client and consultant to stay in touch regarding distribution business launch timeline\n- [ ] Client to connect with Dale's contact regarding the three restaurants\n\n## AI Suggestions\n\nBiggest pain point identified: **Lack of Product Differentiation and Market Saturation**\n\n1. **Curated \"Exclusive\" Collections:** Create tiered portfolio with contractually exclusive rare vintages/boutique labels for this restaurant group\n2. **Fractional Sommelier Program:** Monthly \"Sommelier-for-a-Day\" training package bundled with distribution\n3. **Menu Engineering Consultation:** Design wine pairings using unique SKUs to increase margin and guest satisfaction\n4. **VIP Tasting Events:** Leverage Watermark connection for exclusive tasting events creating pull-demand\n"
  },
  {
    "date": "2025-12-04",
    "title": "Richard - Kimpton - 7 Cellars",
    "filename": "2025-12-04-richard-kimpton.md",
    "content": "# Richard - Kimpton - 7 Cellars\n\n**Date:** 2025-12-04  \n**Location:** Kimpton Hotel  \n**Duration:** 26m 14s  \n**Participants:** Richard (Restaurant Manager, Kimpton), Consultants  \n**Source:** [Plaud Recording](https://web.plaud.ai/s/pub_f43a433e-5bbc-40f1-8888-486d5eff1cbb::lGzuyNcOKeh1frUMa2SdzgT-OuJ_pzBSwKp9muQIeswlPLNMmr_A8LAce31kdY9G7__j4nbNHTCt7VsC)\n\n---\n\n## Overview\n\nThe consultation was with a restaurant manager at the Kimpton hotel, who has 18 years of experience in the food and beverage industry. The discussion centered on the launch of Seven Cellars Wine and Spirits in the Cayman Islands. The primary challenge identified is the lack of wine list diversity, with most restaurants offering identical selections from major distributors like CDG. The customer's restaurant is required to source 80-90% of its wine from CDG (owned by same parent company, Dart). Seven Cellars aims to address this gap with exclusive, custom-tailored wine selections and superior customer service.\n\n## Background\n\n- Restaurant manager at Kimpton hotel, 18 years experience in restaurant/bar industry\n- Recently moved into management after bartending\n- Establishment owned by Dart, which also owns major distributor CDG → 80-90% wine sourcing requirement from CDG\n- Retains some freedom to purchase from other suppliers\n- Broad network in local hospitality industry\n- Has helped open restaurants and manage properties internationally (e.g., Penticton, Canada)\n\n## Pain Points\n\n### Wine List Homogenization\nMost establishments feature identical wine selections from large, dominant distributors. Price rather than uniqueness is the main differentiator. The Kimpton strategically prices wines lower than the Ritz-Carlton. This limits ability to offer a \"more special, more exclusive\" experience. As observed: \"it was like same here, same down the beach, same, you know.\"\n\n### Distributor Customer Service\nFeedback from industry peers indicates customer service from existing large distributors could be better. Superior service — being responsive, reliable, treating restaurants as valued customers — is a significant opportunity.\n\n## Expectations\n\n- **Exclusive wines** not currently available on the island — custom-tailored, \"bespoke\" wine lists matching restaurant's menu, clientele, and concept\n- **Strong incentives** — perks like free case for every 10 ordered (\"a case on 10\"), branded items (buckets)\n- **High-quality service** — responsive, reliable, relationship-building\n- **Sourcing capability** — e.g., wines from Burgundy not currently imported to Cayman Islands; company that \"just says yes\" to requests\n\n## Other Information\n\n- Kimpton targets mature, family-oriented clientele; sister property INDIGRO caters to younger crowd (30s, early 40s)\n- Kimpton pricing strategy: more competitive than Ritz-Carlton (e.g., $17 cost wine vs Ritz at $25)\n- Seven Cellars also open to spirits distribution; long-term vision for premium Caymanian vodka and RTD products\n- Restaurants like Luca, Grand Old House can obtain own import licenses and source directly\n- Suggested venues for market research: Le Petit, Vine to Ocean, Aria\n\n## To-Do List\n\n- [ ] Send follow-up email to Richard with key questions for his F&B Director\n- [ ] Prepare preliminary list of unique, exclusive wines (e.g., from Burgundy)\n- [ ] Research Le Petit, Vine to Ocean, and Aria — analyze wine lists and business models\n- [ ] Develop competitive incentive program (\"1 free case per 10\" model, branded value-adds)\n- [ ] Schedule follow-up meeting with F&B Director\n\n## AI Suggestions\n\nBiggest pain point: **Wine list homogenization**\n\n1. **Curate \"Exclusivity Tiers\":** Basic tier (unique but accessible) and premium \"Signature\" tier with restaurant-exclusive rights in specific areas\n2. **Menu-Pairing Consultation:** Free consultation analyzing food menu to co-create bespoke wine list\n3. **\"Discovery\" Program:** Rotating, limited-availability small-batch wines creating urgency and exclusivity\n4. **Exclusive Tasting Events:** Invite F&B Directors to showcases of unavailable-elsewhere wines\n"
  },
  {
    "date": "2025-12-04",
    "title": "Sean @ Watermark - 7 Cellars",
    "filename": "2025-12-04-sean-watermark.md",
    "content": "# Sean @ Watermark - 7 Cellars\n\n**Date:** 2025-12-04  \n**Location:** Ritz Lobby Bar  \n**Duration:** 1h 0m 2s  \n**Participants:** [Speaker 1], Darryl, [Speaker 3], [Speaker 4], [Speaker 5]  \n**Source:** [Plaud Recording](https://web.plaud.ai/s/pub_cc2c9012-0fd3-4352-b256-0bece2d4d28e::Qt_dhqN_1mzICuQJR2gZtzL45eFqIC70Ku7RNkCVuuF3jvu4I2tmk6q6SYsHEjN7GxZsr6urEa8guBMC)\n\n## Keywords\n`Project Development`, `Luxury Amenities`, `Supply Chain Challenges`, `Wine Business`, `Cayman Islands`, `White-Glove Service`, `High-Net-Worth Clients`\n\n---\n\n## Summary\n\nThis meeting covered two main topics: the final stages of the Watermark luxury property development and a proposal for a new boutique wine and spirits business to serve high-net-worth clients on the island, including Watermark's residents.\n\nThe Watermark project is nearing completion, with furniture delivered and the spa being finished. The property boasts extensive five-star amenities, including a full bar, a large pool deck, private dining rooms, a cinema, and a 16,000 sq ft spa, aiming for a \"mini resort\" feel. The development, however, faced significant post-COVID supply chain disruptions, causing a year-long delay and budget overruns. Sourcing materials like plasterboard and specialized hurricane-rated windows proved challenging for the island-based construction. A major operational hurdle is the property's status as a Strata, which prevents it from obtaining import, liquor, or business licenses. This has made it difficult to source unique, curated food and beverage items, such as non-alcoholic champagne and golden caviar, as they are dependent on local distributors who may not carry these niche products.\n\nIn response to these sourcing challenges, a business opportunity was identified for a niche importer, wholesaler, and retailer of private wines and specialty spirits. The proposed business would focus on providing a \"white-glove service\" rather than competing on volume. This service would include a dedicated sommelier for client consultations, menu pairings, staff training, and building out private cellars for high-net-worth individuals. The service aims to source any SKU a client desires, creating unique collections and leveraging connections with small-production wineries.\n\n[Speaker 4] from Watermark confirmed the need for such a service, noting their model provides food and wine to owners at cost and that their international, ultra-high-net-worth clients value privacy, discretion, and seamless service. While interested in the proposal, [Speaker 4]'s immediate priority for the next two quarters is the flawless move-in of 51 homeowners and ensuring the property is fully operational. It was agreed that they would reconnect to discuss the wine service collaboration after this initial phase is complete.\n\nThe meeting also included a casual discussion about a shared interest in Formula 1, with mentions of drivers like Lando Norris and experiences at the Montreal Grand Prix.\n\n## Next Steps\n\n- [Speaker 4] will focus on opening the Watermark property and managing the initial move-in and operational setup for the first two quarters of the next year.\n- Darryl and [Speaker 4] will reconnect to discuss the white-glove wine service proposal after the Watermark property is fully operational and the initial resident move-in phase is complete.\n\n## AI-Identified Issues\n\n- **Licensing Deadlock:** The primary operational challenge for Watermark is its inability as a Strata to obtain import, liquor, and business licenses. This severely restricts sourcing unique products and creates dependency on local distributors. A clear strategy to navigate these restrictions is needed.\n- **Sourcing Gap:** While the goal is to offer a unique beverage list, there is a gap in sourcing these products. The meeting did not establish a clear plan or partner to procure the desired high-end items not currently available on the island.\n- **Vague Follow-up:** The agreement to reconnect after Watermark is \"open and in there\" lacks a specific timeline, leaving the next steps for the proposed wine business collaboration indefinite.\n- **Undefined Business Model:** While the concept of a boutique wine service was well-received, concrete details regarding the business model (e.g., pricing for sommelier services, pilot project with Watermark) were not defined.\n\n---\n\n## Client Needs Analysis\n\n**Customer:** Sean, Watermark\n\n### Overview\n\nThe consultation is with Sean, who manages the new luxury five-star residency, the Watermark project. The property caters to ultra-high-net-worth individuals, with 51 residences and 48 billionaire owners. Sean's primary challenge is sourcing unique, high-quality products—specifically fine wines, non-alcoholic champagne, and caviar—to elevate the resident experience. Systemic issues, such as the Strata's lack of import, liquor, and business licenses, and the restrictive practices of large local distributors (e.g., forced bundling of unwanted products), prevent him from curating the exclusive food and beverage program he envisions. While interested in a \"White Glove\" wine service partnership that offers sourcing, cellar management, and staff training, Sean's immediate priority is the overwhelming operational task of opening the property and moving in the first 51 homeowners. He is therefore unavailable to engage in a new partnership until the property is fully operational, likely after the first two quarters of the next year.\n\n### Background\n\nThe Watermark is a newly developed, high-end residential property nearing operational readiness. The team is expected to move in before Christmas to set up extensive amenities, including a 16,000 sq ft spa, a 12-room pool with 20 cabanas, two private dining rooms, and a 10-seater cinema. The property is unique as the developer, Fraser, is also an owner and the chairman of the executive committee, ensuring a long-term commitment to quality. The residents are exceptionally wealthy, with apartments averaging 15 million U.S. dollars and the final penthouse selling for 40 million.\n\nThe business model for amenities is unique: everything is provided to owners at cost, with no profit margin, as the stock is owned by the residents within the strata cost. The focus is entirely on providing an unparalleled, home-like experience through quality, exclusivity, and service. Each owner has a private, 56-bottle wine locker in a communal wine room. The property is also planning a \"chef in residence\" program, starting with a two-Michelin-star chef from London. Sean, who has a 40-year background in hospitality, is managing the launch, which involves complex logistics and handling initial building issues (\"snagging\").\n\n### Pain Points\n\n- **Sourcing & Supply Chain Limitations:** As a Strata, the property lacks the necessary import, liquor, and business licenses to source products independently. This forces reliance on the three main local distributors, who often refuse to procure niche items that don't fit their portfolio (e.g., a specific non-alcoholic champagne from Tattinger) or are unavailable on the island (e.g., golden caviar).\n- **Restrictive Distributor Practices:** Current large distributors impose restrictive conditions, forcing clients to buy undesirable items (e.g., \"crappy rosé\") in order to access high-demand products. This \"racket\" conflicts with Watermark's curated, quality-focused model.\n- **Unreliable Wine Stock & Poor Guest Experience:** Sean anticipates that when the property goes live, **30% of the wine list will be unavailable** due to stock issues. The digital wine list app (Vinyu) has a **three-day delay** for updates, making it impossible to manage inventory in real-time. This creates a poor experience for residents who expect seamless service.\n- **Lack of Specialized Curation Services:** There is a gap in the market for high-touch, white-glove services. Sean noted that while software exists to manage residents' personal wine lockers, \"there isn't anybody who can offer\" a professional curation service to manage these collections for the owners, a service Watermark would like to provide.\n- **Immediate Operational Overload:** Sean's most pressing pain point is the overwhelming task of opening the property and moving in 51 homeowners over the next two quarters. He has no time or \"mental capacity\" to engage with new projects, including a wine partnership, until the launch is complete and the property is stabilized.\n\n### Expectations\n\n- **Phased Engagement:** The primary expectation is to revisit the partnership proposal **after the Watermark property is open and operational**, likely after Q2 of the next year. Sean will only have the bandwidth to seriously consider the proposal once the initial launch phase is complete.\n- **Reliable, One-Stop-Shop Service:** For the future, Sean expects a partner who can provide a \"one-stop shop\" that is completely reliable, discreet, and unobtrusive. The service must solve problems seamlessly, from sourcing exclusive SKUs (even from other suppliers) to building out private cellars, without being \"fussy\" or wasting the residents' time.\n- **Sourcing of Exclusive Products:** The partner must be able to source unique, exclusive, and short-supply wines and spirits that are not available through mainstream channels on the island. The goal is to create an evolving, world-class culinary program that adds significant value and offers items that \"others can't get.\"\n- **White-Glove Services:** The customer is looking for a partner to provide \"white-glove\" services beyond simple distribution. This includes a cellar curation service for residents' private lockers and high-quality, in-person staff training (WSET or equivalent), which current distributors do not offer effectively.\n\n### Other Information\n\n- The residency has 51 residences and 48 owners, described as billionaires, many of whom are international.\n- The staff is well-trained, with all team members qualified up to WSET Level Two in wine.\n- The property has invested heavily in custom equipment, including a personalized bar cart and a chef's trolley for tableside service.\n- Sean and his boss are avid Formula 1 fans, and the property plans to host F1-themed events. The consultant also has deep connections in the F1 world.\n- The consultant has connections with exclusive, small-production wineries (e.g., in Burgundy and Canada) willing to allocate product to new markets.\n\n### To-Do List\n\n- [ ] Follow up with Sean after the initial opening phase of Watermark (after Q2 of next year) to schedule a meeting.\n- [ ] Prepare a comprehensive proposal for the follow-up meeting that outlines a \"White Glove,\" one-stop-shop service model.\n- [ ] The proposal should specifically address the key pain points:\n  - A technology-driven solution for the wine stock availability and Vinyu app integration issue.\n  - A cellar curation and management service for residents.\n  - A plan for sourcing exclusive, unique wines and spirits, leveraging existing relationships.\n  - An offer for high-quality staff training.\n- [ ] Offer to have the consultant's sommelier review Watermark's existing wine list to identify gaps and suggest reliably sourced alternatives as a value-add.\n"
  },
  {
    "date": "2025-12-01",
    "title": "Erin & Darryl Intro Call (7 Cellars) — December 1, 2025",
    "filename": "2025-12-01-erin-darryl-intro-call.md",
    "content": "# Erin & Darryl Intro Call (7 Cellars) — December 1, 2025\n\n**Date:** December 1, 2025\n**Duration:** 35 minutes\n**Source:** [Fathom Recording](https://fathom.video/share/nz4H-wMtGvC7JCV9Jr8h1xLmVJZxGo4w)\n\n---\n\n## Meeting Purpose\n\nIntroductory call to align on the Cayman Islands wine import venture.\n\n## Key Takeaways\n\n- **Market Gap:** A clear opportunity exists in Cayman for premium, high-service wine imports, as the market is currently dominated by entry-level brands (e.g., Rombauer Chardonnay).\n- **Favorable Economics:** Cayman's flat $9/liter import tax creates a level playing field, unlike NSLC's tiered system that penalizes premium wines and makes them loss leaders for importers.\n- **Restaurant Pricing:** Cayman restaurants target recouping a bottle's cost with one glass, a model that makes premium wines highly profitable and is enabled by the low, flat import tax.\n- **Sourcing Advantage:** Burgundy wineries are actively seeking new markets to diversify away from US tariffs, creating a direct sourcing opportunity for the new venture.\n\n## Topics\n\n### Cayman Market Opportunity\n- Market dominated by entry-level wines like Rombauer Chardonnay (top seller)\n- Proposed model: \"White glove\" service for high-net-worth individuals and restaurants, mirroring Bishop's Cellar's success\n- Wineries actively seeking new markets to diversify away from US tariffs (currently 15% on French wine)\n  - Goal: Reduce US market share to <10% of total sales\n  - Result: High interest in new, smaller markets like Cayman\n\n### Market Dynamics: NSLC vs. Cayman\n- **NSLC (Nova Scotia Liquor Corporation):** Government monopoly with tiered pricing\n  - Luxury Tax: Higher profit-sharing on products >$50 reduces importer margins on premium wines\n  - Example (Taittinger): Landed cost $63.42 → Retail $108. Licensee discount (10%) drops margin to ~25%. Strategic discount (20%) drops to ~15% (loss leader)\n  - Example (Dom Pérignon): Landed cost $243 → Retail $295. Margin 17.74% (loss leader)\n- **Cayman Islands:** Flat $9/liter import tax\n  - Creates level playing field — $15 bottle and $1,500 bottle incur same tax per liter\n  - Makes premium wines highly profitable for restaurants and importers\n\n### Restaurant Pricing Models\n- **By-the-Glass (BTG):** Goal is to recoup bottle cost with one glass\n  - Example (Gerard Bertrand Rosé): Landed cost $10.64 → Sells for ~$12-15/glass\n- **By-the-Bottle:** Uses a sliding scale, not a simple 2x markup\n  - Example (Taittinger): Buys for ~$75 → Sells for ~$140 (86% markup)\n- Cayman: Flat import tax enables high markups on premium wines\n\n### Logistics & Sourcing\n- **Shipping:** Cayman logistics must be established\n  - Potential solution: Collaborate on containers with a Puerto Rico importer to share costs\n  - Risk: High summer temperatures require refrigerated containers (more expensive, harder to find)\n- **Minimum Orders:**\n  - High-volume wines: Large orders (e.g., 84-case pallet for South American wines)\n  - Premium wines: Available in smaller quantities (e.g., 10-24 cases for Burgundy)\n\n## Next Steps\n\n- **Erin:**\n  - Research and provide typical container shipping costs (including insurance and refrigerated options)\n  - Prepare notes on the questions Darryl sent\n- **Darryl:**\n  - Email Erin the list of questions for the Cayman venture\n- **Both:**\n  - Meet in Cayman to visit restaurants and sommeliers to identify specific market gaps\n  - Discuss Erin's personal goals for the venture\n\n## Action Items\n\n- [ ] Email Darryl landed-cost estimate for full container (shipping + insurance) — *Erin Horton*\n- [ ] Email Erin follow-up questions re: Cayman wine import/logistics — *Darryl Hicks*\n- [ ] Review Darryl's questions; add notes for Cayman discussions — *Erin Horton*\n"
  },
  {
    "date": "2025-11-28",
    "title": "7 Cellars Partner Call — November 28, 2025",
    "filename": "2025-11-28-partner-call.md",
    "content": "# 7 Cellars Partner Call — November 28, 2025\n\n**Date:** November 28, 2025\n**Duration:** 34 minutes\n**Source:** [Fathom Recording](https://fathom.video/share/H-YSkabJ5VrVpwybWcjkTP4MxiRuyrwn)\n\n---\n\n## Meeting Purpose\n\nFinalize the agenda for the upcoming Cayman Islands trip.\n\n## Key Takeaways\n\n- **Trip Focus:** Secure key restaurant meetings, open a company bank account, and add Darryl & Dwayne as signers.\n- **Strategic Targets:** Prioritize high-volume venues (Ritz, Westin) and premium buyers (Grand Old House) to replicate Bishops' successful playbook.\n- **New Sourcing Channel:** Darryl secured direct-to-winery Burgundy contacts, enabling exclusive, high-margin imports.\n- **Logistics:** Kyle will prep the bank for an in-person visit; Aaron will schedule restaurant meetings.\n\n## Topics\n\n### Trip Logistics\n- **Arrivals:**\n  - Dwayne (Wed): 12:15 PM\n  - Darryl (Thu): 12:45 PM\n- **Departure:** Dwayne & Darryl (Sun): 1:30 PM\n- **Kyle's Availability:** Available Thursday evening, Saturday night. Unavailable Friday night, Saturday/Sunday mornings.\n- **Branded Gear:** Shirts, hats, and cards are ready for the trip.\n\n### Bank Account Setup\n- **Goal:** Open a USD account and add Darryl & Dwayne as signers\n- **Rationale:** An in-person visit streamlines the KYC/AML process and enables future remote account management\n- **Partner Accounts:** The new account will serve as a conduit for partners to manage personal funds while maintaining full transparency\n\n### Restaurant Outreach Strategy\n- **Bishops' Playbook:** Replicate the model of Bishops, a successful Nova Scotia distributor\n  - Initial Differentiator: 7-day delivery vs. a government monopoly's 1-day/week service\n  - Product Strategy: Introduced exclusive, high-margin \"banquet wines\" ($4 cost → $30 retail) to avoid direct price comparison\n- **Targeting High-Volume Venues:**\n  - Ritz & Westin: Massive corporate event business offers significant volume potential\n  - Kyle will leverage his Ritz contacts to secure a meeting with the sommelier\n- **Targeting Premium Buyers:**\n  - Grand Old House: A 50+ page wine list signals a sophisticated buyer and an ideal customer profile (ICP)\n  - Aaron will call ahead to identify the key decision-maker\n- **Meeting Prep:** Aaron will call target restaurants and source a premium Burgundy wine for a shared tasting\n\n### Burgundy Sourcing Opportunity\n- Darryl's recent trip to Burgundy yielded direct relationships with wineries\n- Wineries keen to diversify sales beyond the US (~18% of volume) to mitigate tariff risk\n- Secured direct-to-winery access for exclusive wines at wholesale rates, bypassing agents\n- These stories and wines can build rapport with sommeliers and differentiate 7 Cellars\n\n## Next Steps\n\n- **Kyle:**\n  - Contact the bank to get the document list for adding signers\n  - Leverage Ritz contacts to secure a sommelier meeting\n- **Aaron (via Dwayne):**\n  - Call target restaurants (e.g., Grand Old House) to identify contacts and schedule visits\n  - Source a premium Burgundy wine for the trip\n- **Darryl:**\n  - Finalize the financial model after the call with Aaron (Mon)\n- **All:**\n  - Meet at the bank Friday morning to open the account and add signers\n  - Have a partner dinner Thursday evening to review the business plan\n\n## Action Items\n\n- [ ] Email Darryl & Dwayne: bank contact, docs, account-opening steps — *Kyle Klischuk*\n- [ ] Email Aaron: call Grand Old House, Ritz, Westin; ID contacts/best times; confirm wine-bring policy — *Dwayne Schofield*\n- [ ] Email Darryl & Dwayne: Fathom notes — *Darryl Hicks*\n"
  },
  {
    "date": "2025-11-07",
    "title": "7 Cellars Partner Call — November 7, 2025",
    "filename": "2025-11-07-partner-call.md",
    "content": "# 7 Cellars Partner Call — November 7, 2025\n\n**Date:** November 7, 2025\n**Duration:** 21 minutes\n**Source:** [Fathom Recording](https://fathom.video/share/U4eyxXiDknyfUhR_hxnkmxsWnFpU3u6A)\n\n---\n\n## Meeting Purpose\n\nSync on pre-trip prep, focusing on licensing and sales strategy.\n\n## Key Takeaways\n\n- **Licensing is a major risk:** Missing the Nov 11 board meeting could delay sales by three months. The team will pursue an expedited license and a backup plan to use a partner's license.\n- **Sales strategy is set:** AI-generated scripts for sommeliers and F&B directors are ready. The goal for the December trip is to secure POs or firm commitments.\n- **Financial model needs development:** Darryl requires a call with Aaron to build out the unit economics and financial model.\n- **Operations are advancing:** The website is live, professional emails are being configured, and branded merch (shirts, hats) is in production.\n\n## Topics\n\n### Licensing & Sales Readiness\n- **Problem:** Missing the Nov 11 board meeting could delay sales by three months\n  - Process: Business license (expedited) → Import license (requires board approval)\n  - Risk: The import license may require a site inspection of the warehouse\n- **Backup Plan:** Secure a partner's license (e.g., Andy from Agazi) for imports, offering a discount as compensation\n- **Sales Strategy:** Darryl used AI (ChatGPT) to create a sales playbook\n  - Content: Top 5 questions for sommeliers and F&B directors\n  - Goal: Establish credibility, validate market positioning, and secure POs\n  - Method: The playbook uses industry jargon and provides guidance on what to listen for and how to close\n\n### Financials & Operations\n- **Financial Model:** Darryl needs a call with Aaron to build the unit economics and financial model\n- **Expense Tracking:** Darryl will create a shared Google Sheet to track all team expenses from the start\n- **Website & Email:** Website is live; professional emails created; Dwayne configuring forwarding\n- **Merch:** Shirts and hats ordered, will be sent for embroidery\n\n## Next Steps\n\n- **Darryl:**\n  - Create and share the expense tracking Google Sheet\n  - Share the AI-generated sales playbook in the WhatsApp chat\n  - Prepare questions for the financial modeling call with Aaron\n- **Kyle:**\n  - Call DCI today to check the status of the expedited business license\n  - Begin scheduling meetings for the December trip, leaving room for ad hoc opportunities\n- **Dwayne:**\n  - Finalize email forwarding setup and share credentials\n  - Send shirts and hats to the embroiderer\n  - Connect Darryl with Aaron for the financial modeling call\n\n## Action Items\n\n- [ ] Post sales-question guide link in WhatsApp for Dwayne & Kyle review — *Darryl Hicks*\n- [ ] Send Aaron availability to Dwayne; then Dwayne schedule Zoom w/ Aaron — *Darryl Hicks*\n- [ ] Draft Aaron call questions; send to Darryl & Aaron pre-Zoom — *Dwayne Schofield*\n- [ ] Create shared Google Sheet for expense tracking; share link in WhatsApp — *Darryl Hicks*\n- [ ] Call DCI re: license status/timeline; then apply for import license — *Kyle Klischuk*\n- [ ] Enable email forwarding in GoDaddy; send credentials to Darryl & Kyle — *Dwayne Schofield*\n- [ ] Start booking Dec meetings from hit list; leave ad hoc slots — *Kyle Klischuk*\n"
  },
  {
    "date": "2025-10-31",
    "title": "7 Cellars Partner Call — October 31, 2025",
    "filename": "2025-10-31-partner-call.md",
    "content": "# 7 Cellars Partner Call — October 31, 2025\n\n**Date:** October 31, 2025\n**Duration:** 28 minutes\n**Source:** [Fathom Recording](https://fathom.video/share/YRdCA6mZeQXP5Z4DuFM5XB5s2iiFryrJ)\n\n---\n\n## Meeting Purpose\n\nFinalize pre-trip logistics and assign tasks for the Cayman Islands visit.\n\n## Key Takeaways\n\n- **Legal Entity:** Operate as a \"7 Cellars\" DBA under Shoreline to simplify setup and save costs. Kyle will apply for the Trade & Business license, a prerequisite for the liquor license.\n- **Trip Prep:** Dwayne will build the website, order premium merch, and set up email. Darryl will draft a \"10/10 trip\" success document to align on goals and questions.\n- **Bank Accounts:** To avoid delays, Kyle will email Butterfield Bank to confirm required documents *before* the trip, enabling a productive first in-person visit.\n- **Trip Logistics:** Kyle will provide apartments and a car. His availability is limited by \"CO week,\" so the team will prioritize afternoon meetings.\n\n## Topics\n\n### Legal & Banking Setup\n- **Decision:** Operate as a \"7 Cellars\" DBA under Shoreline\n  - Rationale: Simpler and faster than forming a new corp. Liability can be addressed later.\n- **Licensing Process:**\n  - Trade & Business License: Apply under the DBA. Cost: $200, Timeline: 5–10 days\n  - Liquor License: Apply after the Trade & Business license is approved. Next Meeting: Nov 19\n- **Bank Account Strategy:**\n  - Challenge: Cayman bank account setup is notoriously slow, often requiring multiple visits\n  - Plan: Email Butterfield Bank before the trip to confirm all required documents\n  - Goal: Enable a productive first in-person visit by arriving fully prepared\n\n### Branding & Website\n- **Strategy:** Look professional from day one to build credibility\n- **Website:** Dwayne will build a site before the trip (researching platforms; Wix familiar starting point)\n- **Domain:** Kyle will migrate the domain from GoDaddy to the chosen platform\n- **Merch:** Order premium items (e.g., Nike/Adidas polos, hats) that people will want to wear\n- **Social Media:** Dwayne created the Instagram account `@sevensellers.ky`\n\n### Cayman Trip Logistics\n- **Schedule:**\n  - Dwayne & Aaron: Arrive Nov 2 (Tuesday) for market research\n  - Darryl: Arrive Nov 4 (Thursday) for restaurant meetings\n  - Kyle: Availability limited by \"CO week\"\n- **Accommodations:** Kyle will provide apartments for the team\n- **Transportation:** Kyle will provide his Audi RS6\n- **Market Research:** Identify market gaps by inventorying existing liquor store stock (e.g., Jake Scott's, Blackbeard's)\n- **Aaron's Role:** Leverage expertise in boutique wines to build a unique portfolio, avoiding direct competition\n\n## Next Steps\n\n- **Kyle:**\n  - Apply for the \"7 Cellars\" DBA and Trade & Business license\n  - Email Butterfield Bank to confirm required documents for account setup\n  - Schedule restaurant meetings for the trip\n- **Dwayne:**\n  - Finalize website platform and build the site by Nov 3\n  - Order premium merch (polos, hats, cards) for the trip\n- **Darryl:**\n  - Draft the \"10/10 trip\" success document by Nov 7\n  - Collaborate on the final trip itinerary\n\n## Action Items\n\n- [ ] Register DBA '7 Cellars' under Shoreline; apply for Trade & Business License; after approval apply for Liquor License — *Kyle Klischuk*\n- [ ] Schedule restaurant meetings for Nov 6–8 incl. Paul — *Kyle Klischuk*\n- [ ] Order polos, hats, business cards for Cayman trip — *Dwayne Schofield*\n- [ ] Build 7 Cellars website; set up email; coordinate domain migration w/ Kyle — *Dwayne Schofield*\n- [ ] Draft Cayman trip success/itinerary plan; circulate to Dwayne & Kyle — *Darryl Hicks*\n"
  },
  {
    "date": "2025-10-06",
    "title": "7 Cellars Partner Call — October 6, 2025",
    "filename": "2025-10-06-partner-call.md",
    "content": "# 7 Cellars Partner Call — October 6, 2025\n\n**Date:** October 6, 2025\n**Duration:** 30 minutes\n**Source:** [Fathom Recording](https://fathom.video/share/hnzd5B3nzAVaykGd2zemw6m1QEzDysNi)\n\n---\n\n## Meeting Purpose\n\nTo plan upcoming trip to Cayman Islands and discuss strategy for 7 Cellars wine import business.\n\n## Key Takeaways\n\n- Trip tentatively planned for early December (around Dec 2-7), pending final date confirmation\n- Focus on starting simple: import existing wines before considering RTDs or vodka\n- Erin (wine expert) invited to join trip; critical for credibility in meetings\n- Need to investigate liquor licensing requirements and process in Cayman\n\n## Topics\n\n### Trip Planning\n- Dates: Targeting early December, around Dec 2-7\n- Participants: Darryl, Dwayne, Kyle, and potentially Erin (wine expert)\n- Logistics:\n  - Direct flights available from Toronto to Grand Cayman (Air Canada, 5 days/week)\n  - Kyle mentioned CO visit and elders meeting that week; may impact accommodations\n  - Kyle has apartments for rent as potential lodging for Erin\n\n### Business Strategy\n- Three-phase approach proposed:\n  1. Import existing wines (simplest start)\n  2. Consider RTDs (ready-to-drink beverages)\n  3. Develop own vodka brand\n- RTD market in Cayman less developed than North America (opportunity, but not immediate focus)\n- Aim to differentiate by offering unique, high-quality wines not widely available on island\n- Potential to be profitable from first container if pre-orders secured\n\n### Meetings & Relationships\n- Plan to meet with sommeliers and restaurant owners\n- Strategy: Buy nice bottle, share with sommelier, discuss market trends\n- Aim for 10-12 anchor accounts with purchase orders before importing\n- Erin's presence crucial for credibility in wine discussions\n\n### Licensing & Logistics\n- Need to investigate liquor licensing requirements\n  - Potentially need both wholesale and retail licenses\n  - Kyle to research process, timing, and costs\n- Explore possibility of using existing license from a contact (bartender)\n\n### Market Insights (from Adam, industry contact)\n- Incentives common for introducing new products (e.g., cash prizes for staff)\n- Canadian wines could be interesting differentiator, but may require education\n- Gap in market for accessible premium wines, older vintages\n\n## Next Steps\n\n- **Darryl:** Finalize trip dates, update business plan\n- **Dwayne:** Confirm Erin's availability and arrangements\n- **Kyle:** Research liquor licensing requirements and process\n- **All:** Develop detailed itinerary for Cayman visit once dates confirmed\n- Consider pre-selling to 10-12 anchor accounts before importing first container\n\n## Action Items\n\n- [ ] Send potential Cayman trip dates (early Dec, ~3rd) to group chat — *Darryl Hicks*\n- [ ] Research alcohol import/retail licensing reqs, costs, timelines; explore borrowing existing license — *Kyle Klischuk*\n- [ ] Update business plan w/ Adam convo insights; share w/ team for review — *Darryl Hicks*\n- [ ] Confirm Erin's availability for early Dec Cayman trip; arrange same flight as Dwayne — *Dwayne Schofield*\n"
  },
  {
    "date": "2025-09-05",
    "title": "7 Cellars Partner Call — September 5, 2025",
    "filename": "2025-09-05-partner-call.md",
    "content": "# 7 Cellars Partner Call — September 5, 2025\n\n**Date:** September 5, 2025\n**Duration:** 45 minutes\n**Source:** [Fathom Recording](https://fathom.video/share/zAVPzegy8dmUFbnb5_gSKCzAnVPRJXvC)\n\n---\n\n## Meeting Purpose\n\nDiscuss and align on initial business strategies for 7 Cellars, exploring wine and RTD (Ready-to-Drink) options for fastest path to profitability.\n\n## Key Takeaways\n\n- Agreement to pursue both wine and RTD options, with focus on determining fastest path to profitability\n- Plan to conduct market research and explore local partnerships in Cayman for both wine and RTD production/distribution\n- Potential in-person meetup in Cayman planned for late November/early December to further business discussions\n\n## Topics\n\n### Wine Business Strategy\n- Initially thought to be fastest to profitability\n- Target markets: restaurants and high-net-worth individuals building cellars\n- Potential for both vintage and mass-market SKUs\n- Kyle to discuss with local restaurant owners (Chad and Leif) about wine purchasing habits and interest\n- Estimated margins: ~300% (e.g., $250,000 container cost, $750,000 gross revenue)\n\n### RTD (Ready-to-Drink) Opportunity\n- Fastest growing category in global liquor sales\n- Potential for quicker profitability than wine due to faster production-to-sale cycle\n- Explore vodka-based RTDs, possibly hard iced teas\n- Investigate local co-packing options in Cayman for canning\n- Dwayne to research RTD recipes and production costs with contacts in Nova Scotia\n\n### Brand Building Strategy\n- Long-term goal: Build equity in premium alcohol brand (likely vodka)\n- RTD could serve as entry point for brand recognition\n- Potential to layer product offerings: RTD → Vodka → Ultra-premium gift product\n\n### Local Partnerships and Production\n- Explore co-packing options with local Cayman breweries (e.g., K-Brew)\n- Investigate collaborative culture among local alcohol producers in Cayman\n- Kyle to discuss with local cannery about potential partnership\n\n### Market Research\n- Darryl to discuss Cayman market with 5-0, exploring both wine and RTD potential\n- Kyle to meet with local restaurant owners to gauge interest and current purchasing habits\n\n## Next Steps\n\n- **Kyle:** Contact Chad and Leif (restaurant owners) to discuss wine purchasing and potential interest\n- **Kyle:** Reach out to local Cayman cannery to explore partnership options\n- **Darryl:** Set up call with 5-0 to discuss Cayman wine and RTD market\n- **Dwayne:** Connect with Nova Scotia contacts for RTD recipe and production insights\n- **All:** Reconvene next Friday to share findings and further develop strategy\n- Consider planning in-person meetup in Cayman for late November/early December\n\n## Action Items\n\n- [ ] Contact neighbor (K-Brew brewmaster) re RTD co-packing possibilities, costs — *Kyle*\n- [ ] Call w/ 5-0. Discuss Cayman wine market, RTD appetite. Get contacts for distribution — *Darryl Hicks*\n- [ ] Contact NS RTD makers. Get recipe details, costs, samples. Ensure high quality — *Dwayne Schofield*\n- [ ] Call Chad & Leif (13 restaurant owners). Discuss wine needs, pricing, interest in our plan. Set meeting if possible — *Kyle*\n"
  }
]