{
  "drafts": [
    {
      "recipient": "David Chang, CTO at Apex Technologies",
      "company": "Apex Technologies",
      "subject": "Quick question about your data orchestration stack",
      "status": "ready",
      "body": "Hi David,\n\nI noticed Apex just expanded into the healthcare vertical — congrats on the Cedars-Sinai win. We've been helping similar companies automate their data pipelines and cut engineering overhead by 40%.\n\nWould you be open to a 15-min call next week? I'd love to share what we've learned working with companies at your scale.\n\nBest,\nAlex",
      "context": "Met at TechCrunch Disrupt. Expressed interest in automation tooling. Healthcare expansion creates data compliance needs we solve."
    },
    {
      "recipient": "Jennifer Wu, VP Product at Cascade Inc",
      "company": "Cascade Inc",
      "subject": "Loved your talk on product-led growth",
      "status": "ready",
      "body": "Hi Jennifer,\n\nYour PLG talk at SaaStr was fantastic — especially the bit about activation metrics. We're applying similar principles at Acme and seeing great results.\n\nI'd love to exchange notes. We recently crossed 500 self-serve signups/month and I think there's an interesting collaboration opportunity around our platforms.\n\nCoffee or Zoom next week?\n\nBest,\nAlex",
      "context": "Strategic partnership target. Cascade's user base overlaps with our ICP. Potential integration partnership."
    },
    {
      "recipient": "Robert Kim, Managing Director at Pacific Ventures",
      "company": "Pacific Ventures",
      "subject": "AI-powered operations for portfolio companies",
      "status": "sent",
      "sentDate": "Feb 20, 2026",
      "body": "Hi Robert,\n\nI'm Alex, CEO of Acme Ventures. We build AI agents that automate executive operations — from email triage to competitive intel to meeting prep.\n\nI understand Pacific Ventures has 40+ portfolio companies. We're seeing strong traction with venture-backed companies who want to move faster with leaner teams.\n\nWould it be valuable to explore a portfolio-wide partnership?\n\nBest,\nAlex",
      "context": "Warm intro via Sequoia connection. Pacific Ventures portfolio would be 40+ potential customers."
    }
  ]
}
